garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.inc
// Register: ZCD1CON
#define ZCD1CON ZCD1CON
ZCD1CON                                  equ 004Ch
// bitfield definitions
ZCD1CON_ZCD1INTN_POSN                    equ 0000h
ZCD1CON_ZCD1INTN_POSITION                equ 0000h
ZCD1CON_ZCD1INTN_SIZE                    equ 0001h
ZCD1CON_ZCD1INTN_LENGTH                  equ 0001h
ZCD1CON_ZCD1INTN_MASK                    equ 0001h
ZCD1CON_ZCD1INTP_POSN                    equ 0001h
ZCD1CON_ZCD1INTP_POSITION                equ 0001h
ZCD1CON_ZCD1INTP_SIZE                    equ 0001h
ZCD1CON_ZCD1INTP_LENGTH                  equ 0001h
ZCD1CON_ZCD1INTP_MASK                    equ 0002h
ZCD1CON_ZCD1POL_POSN                     equ 0004h
ZCD1CON_ZCD1POL_POSITION                 equ 0004h
ZCD1CON_ZCD1POL_SIZE                     equ 0001h
ZCD1CON_ZCD1POL_LENGTH                   equ 0001h
ZCD1CON_ZCD1POL_MASK                     equ 0010h
ZCD1CON_ZCD1OUT_POSN                     equ 0005h
ZCD1CON_ZCD1OUT_POSITION                 equ 0005h
ZCD1CON_ZCD1OUT_SIZE                     equ 0001h
ZCD1CON_ZCD1OUT_LENGTH                   equ 0001h
ZCD1CON_ZCD1OUT_MASK                     equ 0020h
ZCD1CON_ZCD1EN_POSN                      equ 0007h
ZCD1CON_ZCD1EN_POSITION                  equ 0007h
ZCD1CON_ZCD1EN_SIZE                      equ 0001h
ZCD1CON_ZCD1EN_LENGTH                    equ 0001h
ZCD1CON_ZCD1EN_MASK                      equ 0080h

// Register: ZCD2CON
#define ZCD2CON ZCD2CON
ZCD2CON                                  equ 004Dh
// bitfield definitions
ZCD2CON_ZCD2INTN_POSN                    equ 0000h
ZCD2CON_ZCD2INTN_POSITION                equ 0000h
ZCD2CON_ZCD2INTN_SIZE                    equ 0001h
ZCD2CON_ZCD2INTN_LENGTH                  equ 0001h
ZCD2CON_ZCD2INTN_MASK                    equ 0001h
ZCD2CON_ZCD2INTP_POSN                    equ 0001h
ZCD2CON_ZCD2INTP_POSITION                equ 0001h
ZCD2CON_ZCD2INTP_SIZE                    equ 0001h
ZCD2CON_ZCD2INTP_LENGTH                  equ 0001h
ZCD2CON_ZCD2INTP_MASK                    equ 0002h
ZCD2CON_ZCD2POL_POSN                     equ 0004h
ZCD2CON_ZCD2POL_POSITION                 equ 0004h
ZCD2CON_ZCD2POL_SIZE                     equ 0001h
ZCD2CON_ZCD2POL_LENGTH                   equ 0001h
ZCD2CON_ZCD2POL_MASK                     equ 0010h
ZCD2CON_ZCD2OUT_POSN                     equ 0005h
ZCD2CON_ZCD2OUT_POSITION                 equ 0005h
ZCD2CON_ZCD2OUT_SIZE                     equ 0001h
ZCD2CON_ZCD2OUT_LENGTH                   equ 0001h
ZCD2CON_ZCD2OUT_MASK                     equ 0020h
ZCD2CON_ZCD2EN_POSN                      equ 0007h
ZCD2CON_ZCD2EN_POSITION                  equ 0007h
ZCD2CON_ZCD2EN_SIZE                      equ 0001h
ZCD2CON_ZCD2EN_LENGTH                    equ 0001h
ZCD2CON_ZCD2EN_MASK                      equ 0080h

// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0062h
// bitfield definitions
PMD0_IOCMD_POSN                          equ 0000h
PMD0_IOCMD_POSITION                      equ 0000h
PMD0_IOCMD_SIZE                          equ 0001h
PMD0_IOCMD_LENGTH                        equ 0001h
PMD0_IOCMD_MASK                          equ 0001h
PMD0_CLKRMD_POSN                         equ 0001h
PMD0_CLKRMD_POSITION                     equ 0001h
PMD0_CLKRMD_SIZE                         equ 0001h
PMD0_CLKRMD_LENGTH                       equ 0001h
PMD0_CLKRMD_MASK                         equ 0002h
PMD0_SCANMD_POSN                         equ 0003h
PMD0_SCANMD_POSITION                     equ 0003h
PMD0_SCANMD_SIZE                         equ 0001h
PMD0_SCANMD_LENGTH                       equ 0001h
PMD0_SCANMD_MASK                         equ 0008h
PMD0_CRCMD_POSN                          equ 0004h
PMD0_CRCMD_POSITION                      equ 0004h
PMD0_CRCMD_SIZE                          equ 0001h
PMD0_CRCMD_LENGTH                        equ 0001h
PMD0_CRCMD_MASK                          equ 0010h
PMD0_HLVDMD_POSN                         equ 0005h
PMD0_HLVDMD_POSITION                     equ 0005h
PMD0_HLVDMD_SIZE                         equ 0001h
PMD0_HLVDMD_LENGTH                       equ 0001h
PMD0_HLVDMD_MASK                         equ 0020h
PMD0_FVRMD_POSN                          equ 0006h
PMD0_FVRMD_POSITION                      equ 0006h
PMD0_FVRMD_SIZE                          equ 0001h
PMD0_FVRMD_LENGTH                        equ 0001h
PMD0_FVRMD_MASK                          equ 0040h
PMD0_SYSCMD_POSN                         equ 0007h
PMD0_SYSCMD_POSITION                     equ 0007h
PMD0_SYSCMD_SIZE                         equ 0001h
PMD0_SYSCMD_LENGTH                       equ 0001h
PMD0_SYSCMD_MASK                         equ 0080h
PMD0_LVDMD_POSN                          equ 0005h
PMD0_LVDMD_POSITION                      equ 0005h
PMD0_LVDMD_SIZE                          equ 0001h
PMD0_LVDMD_LENGTH                        equ 0001h
PMD0_LVDMD_MASK                          equ 0020h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0063h
// bitfield definitions
PMD1_TMR0MD_POSN                         equ 0000h
PMD1_TMR0MD_POSITION                     equ 0000h
PMD1_TMR0MD_SIZE                         equ 0001h
PMD1_TMR0MD_LENGTH                       equ 0001h
PMD1_TMR0MD_MASK                         equ 0001h
PMD1_TMR1MD_POSN                         equ 0001h
PMD1_TMR1MD_POSITION                     equ 0001h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR3MD_POSN                         equ 0003h
PMD1_TMR3MD_POSITION                     equ 0003h
PMD1_TMR3MD_SIZE                         equ 0001h
PMD1_TMR3MD_LENGTH                       equ 0001h
PMD1_TMR3MD_MASK                         equ 0008h
PMD1_TMR4MD_POSN                         equ 0004h
PMD1_TMR4MD_POSITION                     equ 0004h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0010h
PMD1_TMR6MD_POSN                         equ 0005h
PMD1_TMR6MD_POSITION                     equ 0005h
PMD1_TMR6MD_SIZE                         equ 0001h
PMD1_TMR6MD_LENGTH                       equ 0001h
PMD1_TMR6MD_MASK                         equ 0020h
PMD1_ZCD1MD_POSN                         equ 0006h
PMD1_ZCD1MD_POSITION                     equ 0006h
PMD1_ZCD1MD_SIZE                         equ 0001h
PMD1_ZCD1MD_LENGTH                       equ 0001h
PMD1_ZCD1MD_MASK                         equ 0040h
PMD1_CM1MD_POSN                          equ 0007h
PMD1_CM1MD_POSITION                      equ 0007h
PMD1_CM1MD_SIZE                          equ 0001h
PMD1_CM1MD_LENGTH                        equ 0001h
PMD1_CM1MD_MASK                          equ 0080h

