garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.inc
// Register: SPI1INTF
#define SPI1INTF SPI1INTF
SPI1INTF                                 equ 008Ah
// bitfield definitions
SPI1INTF_TXUIF_POSN                      equ 0001h
SPI1INTF_TXUIF_POSITION                  equ 0001h
SPI1INTF_TXUIF_SIZE                      equ 0001h
SPI1INTF_TXUIF_LENGTH                    equ 0001h
SPI1INTF_TXUIF_MASK                      equ 0002h
SPI1INTF_RXOIF_POSN                      equ 0002h
SPI1INTF_RXOIF_POSITION                  equ 0002h
SPI1INTF_RXOIF_SIZE                      equ 0001h
SPI1INTF_RXOIF_LENGTH                    equ 0001h
SPI1INTF_RXOIF_MASK                      equ 0004h
SPI1INTF_EOSIF_POSN                      equ 0004h
SPI1INTF_EOSIF_POSITION                  equ 0004h
SPI1INTF_EOSIF_SIZE                      equ 0001h
SPI1INTF_EOSIF_LENGTH                    equ 0001h
SPI1INTF_EOSIF_MASK                      equ 0010h
SPI1INTF_SOSIF_POSN                      equ 0005h
SPI1INTF_SOSIF_POSITION                  equ 0005h
SPI1INTF_SOSIF_SIZE                      equ 0001h
SPI1INTF_SOSIF_LENGTH                    equ 0001h
SPI1INTF_SOSIF_MASK                      equ 0020h
SPI1INTF_TCZIF_POSN                      equ 0006h
SPI1INTF_TCZIF_POSITION                  equ 0006h
SPI1INTF_TCZIF_SIZE                      equ 0001h
SPI1INTF_TCZIF_LENGTH                    equ 0001h
SPI1INTF_TCZIF_MASK                      equ 0040h
SPI1INTF_SRMTIF_POSN                     equ 0007h
SPI1INTF_SRMTIF_POSITION                 equ 0007h
SPI1INTF_SRMTIF_SIZE                     equ 0001h
SPI1INTF_SRMTIF_LENGTH                   equ 0001h
SPI1INTF_SRMTIF_MASK                     equ 0080h
SPI1INTF_SPI1TXUIF_POSN                  equ 0001h
SPI1INTF_SPI1TXUIF_POSITION              equ 0001h
SPI1INTF_SPI1TXUIF_SIZE                  equ 0001h
SPI1INTF_SPI1TXUIF_LENGTH                equ 0001h
SPI1INTF_SPI1TXUIF_MASK                  equ 0002h
SPI1INTF_SPI1RXOIF_POSN                  equ 0002h
SPI1INTF_SPI1RXOIF_POSITION              equ 0002h
SPI1INTF_SPI1RXOIF_SIZE                  equ 0001h
SPI1INTF_SPI1RXOIF_LENGTH                equ 0001h
SPI1INTF_SPI1RXOIF_MASK                  equ 0004h
SPI1INTF_SPI1EOSIF_POSN                  equ 0004h
SPI1INTF_SPI1EOSIF_POSITION              equ 0004h
SPI1INTF_SPI1EOSIF_SIZE                  equ 0001h
SPI1INTF_SPI1EOSIF_LENGTH                equ 0001h
SPI1INTF_SPI1EOSIF_MASK                  equ 0010h
SPI1INTF_SPI1SOSIF_POSN                  equ 0005h
SPI1INTF_SPI1SOSIF_POSITION              equ 0005h
SPI1INTF_SPI1SOSIF_SIZE                  equ 0001h
SPI1INTF_SPI1SOSIF_LENGTH                equ 0001h
SPI1INTF_SPI1SOSIF_MASK                  equ 0020h
SPI1INTF_SPI1TCZIF_POSN                  equ 0006h
SPI1INTF_SPI1TCZIF_POSITION              equ 0006h
SPI1INTF_SPI1TCZIF_SIZE                  equ 0001h
SPI1INTF_SPI1TCZIF_LENGTH                equ 0001h
SPI1INTF_SPI1TCZIF_MASK                  equ 0040h
SPI1INTF_SPI1SRMTIF_POSN                 equ 0007h
SPI1INTF_SPI1SRMTIF_POSITION             equ 0007h
SPI1INTF_SPI1SRMTIF_SIZE                 equ 0001h
SPI1INTF_SPI1SRMTIF_LENGTH               equ 0001h
SPI1INTF_SPI1SRMTIF_MASK                 equ 0080h

// Register: SPI1INTE
#define SPI1INTE SPI1INTE
SPI1INTE                                 equ 008Bh
// bitfield definitions
SPI1INTE_TXUIE_POSN                      equ 0001h
SPI1INTE_TXUIE_POSITION                  equ 0001h
SPI1INTE_TXUIE_SIZE                      equ 0001h
SPI1INTE_TXUIE_LENGTH                    equ 0001h
SPI1INTE_TXUIE_MASK                      equ 0002h
SPI1INTE_RXOIE_POSN                      equ 0002h
SPI1INTE_RXOIE_POSITION                  equ 0002h
SPI1INTE_RXOIE_SIZE                      equ 0001h
SPI1INTE_RXOIE_LENGTH                    equ 0001h
SPI1INTE_RXOIE_MASK                      equ 0004h
SPI1INTE_EOSIE_POSN                      equ 0004h
SPI1INTE_EOSIE_POSITION                  equ 0004h
SPI1INTE_EOSIE_SIZE                      equ 0001h
SPI1INTE_EOSIE_LENGTH                    equ 0001h
SPI1INTE_EOSIE_MASK                      equ 0010h
SPI1INTE_SOSIE_POSN                      equ 0005h
SPI1INTE_SOSIE_POSITION                  equ 0005h
SPI1INTE_SOSIE_SIZE                      equ 0001h
SPI1INTE_SOSIE_LENGTH                    equ 0001h
SPI1INTE_SOSIE_MASK                      equ 0020h
SPI1INTE_TCZIE_POSN                      equ 0006h
SPI1INTE_TCZIE_POSITION                  equ 0006h
SPI1INTE_TCZIE_SIZE                      equ 0001h
SPI1INTE_TCZIE_LENGTH                    equ 0001h
SPI1INTE_TCZIE_MASK                      equ 0040h
SPI1INTE_SRMTIE_POSN                     equ 0007h
SPI1INTE_SRMTIE_POSITION                 equ 0007h
SPI1INTE_SRMTIE_SIZE                     equ 0001h
SPI1INTE_SRMTIE_LENGTH                   equ 0001h
SPI1INTE_SRMTIE_MASK                     equ 0080h
SPI1INTE_SPI1TXUIE_POSN                  equ 0001h
SPI1INTE_SPI1TXUIE_POSITION              equ 0001h
SPI1INTE_SPI1TXUIE_SIZE                  equ 0001h
SPI1INTE_SPI1TXUIE_LENGTH                equ 0001h
SPI1INTE_SPI1TXUIE_MASK                  equ 0002h
SPI1INTE_SPI1RXOIE_POSN                  equ 0002h
SPI1INTE_SPI1RXOIE_POSITION              equ 0002h
SPI1INTE_SPI1RXOIE_SIZE                  equ 0001h
SPI1INTE_SPI1RXOIE_LENGTH                equ 0001h
SPI1INTE_SPI1RXOIE_MASK                  equ 0004h
SPI1INTE_SPI1EOSIE_POSN                  equ 0004h
SPI1INTE_SPI1EOSIE_POSITION              equ 0004h
SPI1INTE_SPI1EOSIE_SIZE                  equ 0001h
SPI1INTE_SPI1EOSIE_LENGTH                equ 0001h
SPI1INTE_SPI1EOSIE_MASK                  equ 0010h
SPI1INTE_SPI1SOSIE_POSN                  equ 0005h
SPI1INTE_SPI1SOSIE_POSITION              equ 0005h
SPI1INTE_SPI1SOSIE_SIZE                  equ 0001h
SPI1INTE_SPI1SOSIE_LENGTH                equ 0001h
SPI1INTE_SPI1SOSIE_MASK                  equ 0020h
SPI1INTE_SPI1TCZIE_POSN                  equ 0006h
SPI1INTE_SPI1TCZIE_POSITION              equ 0006h
SPI1INTE_SPI1TCZIE_SIZE                  equ 0001h
SPI1INTE_SPI1TCZIE_LENGTH                equ 0001h
SPI1INTE_SPI1TCZIE_MASK                  equ 0040h
SPI1INTE_SPI1SRMTIE_POSN                 equ 0007h
SPI1INTE_SPI1SRMTIE_POSITION             equ 0007h
SPI1INTE_SPI1SRMTIE_SIZE                 equ 0001h
SPI1INTE_SPI1SRMTIE_LENGTH               equ 0001h
SPI1INTE_SPI1SRMTIE_MASK                 equ 0080h

// Register: SPI1CLK
#define SPI1CLK SPI1CLK
SPI1CLK                                  equ 008Ch
// bitfield definitions
SPI1CLK_CLKSEL_POSN                      equ 0000h
SPI1CLK_CLKSEL_POSITION                  equ 0000h
SPI1CLK_CLKSEL_SIZE                      equ 0008h
SPI1CLK_CLKSEL_LENGTH                    equ 0008h
SPI1CLK_CLKSEL_MASK                      equ 00FFh
SPI1CLK_CLKSEL0_POSN                     equ 0000h
SPI1CLK_CLKSEL0_POSITION                 equ 0000h
SPI1CLK_CLKSEL0_SIZE                     equ 0001h
SPI1CLK_CLKSEL0_LENGTH                   equ 0001h
SPI1CLK_CLKSEL0_MASK                     equ 0001h
SPI1CLK_CLKSEL1_POSN                     equ 0001h
SPI1CLK_CLKSEL1_POSITION                 equ 0001h
SPI1CLK_CLKSEL1_SIZE                     equ 0001h
SPI1CLK_CLKSEL1_LENGTH                   equ 0001h
SPI1CLK_CLKSEL1_MASK                     equ 0002h
SPI1CLK_CLKSEL2_POSN                     equ 0002h
SPI1CLK_CLKSEL2_POSITION                 equ 0002h
SPI1CLK_CLKSEL2_SIZE                     equ 0001h
SPI1CLK_CLKSEL2_LENGTH                   equ 0001h
SPI1CLK_CLKSEL2_MASK                     equ 0004h
SPI1CLK_CLKSEL3_POSN                     equ 0003h
SPI1CLK_CLKSEL3_POSITION                 equ 0003h
SPI1CLK_CLKSEL3_SIZE                     equ 0001h
SPI1CLK_CLKSEL3_LENGTH                   equ 0001h
SPI1CLK_CLKSEL3_MASK                     equ 0008h
SPI1CLK_CLKSEL4_POSN                     equ 0004h
SPI1CLK_CLKSEL4_POSITION                 equ 0004h
SPI1CLK_CLKSEL4_SIZE                     equ 0001h
SPI1CLK_CLKSEL4_LENGTH                   equ 0001h
SPI1CLK_CLKSEL4_MASK                     equ 0010h
SPI1CLK_SPI1CLKSEL_POSN                  equ 0000h
SPI1CLK_SPI1CLKSEL_POSITION              equ 0000h
SPI1CLK_SPI1CLKSEL_SIZE                  equ 0008h
SPI1CLK_SPI1CLKSEL_LENGTH                equ 0008h
SPI1CLK_SPI1CLKSEL_MASK                  equ 00FFh
SPI1CLK_SPI1CLKSEL0_POSN                 equ 0000h
SPI1CLK_SPI1CLKSEL0_POSITION             equ 0000h
SPI1CLK_SPI1CLKSEL0_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL0_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL0_MASK                 equ 0001h
SPI1CLK_SPI1CLKSEL1_POSN                 equ 0001h
SPI1CLK_SPI1CLKSEL1_POSITION             equ 0001h
SPI1CLK_SPI1CLKSEL1_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL1_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL1_MASK                 equ 0002h
SPI1CLK_SPI1CLKSEL2_POSN                 equ 0002h
SPI1CLK_SPI1CLKSEL2_POSITION             equ 0002h
SPI1CLK_SPI1CLKSEL2_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL2_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL2_MASK                 equ 0004h
SPI1CLK_SPI1CLKSEL3_POSN                 equ 0003h
SPI1CLK_SPI1CLKSEL3_POSITION             equ 0003h
SPI1CLK_SPI1CLKSEL3_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL3_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL3_MASK                 equ 0008h
SPI1CLK_SPI1CLKSEL4_POSN                 equ 0004h
SPI1CLK_SPI1CLKSEL4_POSITION             equ 0004h
SPI1CLK_SPI1CLKSEL4_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL4_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL4_MASK                 equ 0010h

// Register: SPI2RXB
#define SPI2RXB SPI2RXB
SPI2RXB                                  equ 008Dh
// bitfield definitions
SPI2RXB_RXB_POSN                         equ 0000h
SPI2RXB_RXB_POSITION                     equ 0000h
SPI2RXB_RXB_SIZE                         equ 0008h
SPI2RXB_RXB_LENGTH                       equ 0008h
SPI2RXB_RXB_MASK                         equ 00FFh
SPI2RXB_RXB0_POSN                        equ 0000h
SPI2RXB_RXB0_POSITION                    equ 0000h
SPI2RXB_RXB0_SIZE                        equ 0001h
SPI2RXB_RXB0_LENGTH                      equ 0001h
SPI2RXB_RXB0_MASK                        equ 0001h
SPI2RXB_RXB1_POSN                        equ 0001h
SPI2RXB_RXB1_POSITION                    equ 0001h
SPI2RXB_RXB1_SIZE                        equ 0001h
SPI2RXB_RXB1_LENGTH                      equ 0001h
SPI2RXB_RXB1_MASK                        equ 0002h
SPI2RXB_RXB2_POSN                        equ 0002h
SPI2RXB_RXB2_POSITION                    equ 0002h
SPI2RXB_RXB2_SIZE                        equ 0001h
SPI2RXB_RXB2_LENGTH                      equ 0001h
SPI2RXB_RXB2_MASK                        equ 0004h
SPI2RXB_RXB3_POSN                        equ 0003h
SPI2RXB_RXB3_POSITION                    equ 0003h
SPI2RXB_RXB3_SIZE                        equ 0001h
SPI2RXB_RXB3_LENGTH                      equ 0001h
SPI2RXB_RXB3_MASK                        equ 0008h
SPI2RXB_RXB4_POSN                        equ 0004h
SPI2RXB_RXB4_POSITION                    equ 0004h
SPI2RXB_RXB4_SIZE                        equ 0001h
SPI2RXB_RXB4_LENGTH                      equ 0001h
SPI2RXB_RXB4_MASK                        equ 0010h
SPI2RXB_RXB5_POSN                        equ 0005h
SPI2RXB_RXB5_POSITION                    equ 0005h
SPI2RXB_RXB5_SIZE                        equ 0001h
SPI2RXB_RXB5_LENGTH                      equ 0001h
SPI2RXB_RXB5_MASK                        equ 0020h
SPI2RXB_RXB6_POSN                        equ 0006h
SPI2RXB_RXB6_POSITION                    equ 0006h
SPI2RXB_RXB6_SIZE                        equ 0001h
SPI2RXB_RXB6_LENGTH                      equ 0001h
SPI2RXB_RXB6_MASK                        equ 0040h
SPI2RXB_RXB7_POSN                        equ 0007h
SPI2RXB_RXB7_POSITION                    equ 0007h
SPI2RXB_RXB7_SIZE                        equ 0001h
SPI2RXB_RXB7_LENGTH                      equ 0001h
SPI2RXB_RXB7_MASK                        equ 0080h

// Register: SPI2TXB
#define SPI2TXB SPI2TXB
SPI2TXB                                  equ 008Eh
// bitfield definitions
SPI2TXB_TXB_POSN                         equ 0000h
SPI2TXB_TXB_POSITION                     equ 0000h
SPI2TXB_TXB_SIZE                         equ 0008h
SPI2TXB_TXB_LENGTH                       equ 0008h
SPI2TXB_TXB_MASK                         equ 00FFh
SPI2TXB_TXB0_POSN                        equ 0000h
SPI2TXB_TXB0_POSITION                    equ 0000h
SPI2TXB_TXB0_SIZE                        equ 0001h
SPI2TXB_TXB0_LENGTH                      equ 0001h
SPI2TXB_TXB0_MASK                        equ 0001h
SPI2TXB_TXB1_POSN                        equ 0001h
SPI2TXB_TXB1_POSITION                    equ 0001h
SPI2TXB_TXB1_SIZE                        equ 0001h
SPI2TXB_TXB1_LENGTH                      equ 0001h
SPI2TXB_TXB1_MASK                        equ 0002h
SPI2TXB_TXB2_POSN                        equ 0002h
SPI2TXB_TXB2_POSITION                    equ 0002h
SPI2TXB_TXB2_SIZE                        equ 0001h
SPI2TXB_TXB2_LENGTH                      equ 0001h
SPI2TXB_TXB2_MASK                        equ 0004h
SPI2TXB_TXB3_POSN                        equ 0003h
SPI2TXB_TXB3_POSITION                    equ 0003h
SPI2TXB_TXB3_SIZE                        equ 0001h
SPI2TXB_TXB3_LENGTH                      equ 0001h
SPI2TXB_TXB3_MASK                        equ 0008h
SPI2TXB_TXB4_POSN                        equ 0004h
SPI2TXB_TXB4_POSITION                    equ 0004h
SPI2TXB_TXB4_SIZE                        equ 0001h
SPI2TXB_TXB4_LENGTH                      equ 0001h
SPI2TXB_TXB4_MASK                        equ 0010h
SPI2TXB_TXB5_POSN                        equ 0005h
SPI2TXB_TXB5_POSITION                    equ 0005h
SPI2TXB_TXB5_SIZE                        equ 0001h
SPI2TXB_TXB5_LENGTH                      equ 0001h
SPI2TXB_TXB5_MASK                        equ 0020h
SPI2TXB_TXB6_POSN                        equ 0006h
SPI2TXB_TXB6_POSITION                    equ 0006h
SPI2TXB_TXB6_SIZE                        equ 0001h
SPI2TXB_TXB6_LENGTH                      equ 0001h
SPI2TXB_TXB6_MASK                        equ 0040h
SPI2TXB_TXB7_POSN                        equ 0007h
SPI2TXB_TXB7_POSITION                    equ 0007h
SPI2TXB_TXB7_SIZE                        equ 0001h
SPI2TXB_TXB7_LENGTH                      equ 0001h
SPI2TXB_TXB7_MASK                        equ 0080h

// Register: SPI2TCNT
#define SPI2TCNT SPI2TCNT
SPI2TCNT                                 equ 008Fh

// Register: SPI2TCNTL
#define SPI2TCNTL SPI2TCNTL
SPI2TCNTL                                equ 008Fh
// bitfield definitions
SPI2TCNTL_TCNTL_POSN                     equ 0000h
SPI2TCNTL_TCNTL_POSITION                 equ 0000h
SPI2TCNTL_TCNTL_SIZE                     equ 0008h
SPI2TCNTL_TCNTL_LENGTH                   equ 0008h
SPI2TCNTL_TCNTL_MASK                     equ 00FFh

// Register: SPI2TCNTH
#define SPI2TCNTH SPI2TCNTH
SPI2TCNTH                                equ 0090h
// bitfield definitions
SPI2TCNTH_TCNTH_POSN                     equ 0000h
SPI2TCNTH_TCNTH_POSITION                 equ 0000h
SPI2TCNTH_TCNTH_SIZE                     equ 0003h
SPI2TCNTH_TCNTH_LENGTH                   equ 0003h
SPI2TCNTH_TCNTH_MASK                     equ 0007h

// Register: SPI2CON0
#define SPI2CON0 SPI2CON0
SPI2CON0                                 equ 0091h
// bitfield definitions
SPI2CON0_BMODE_POSN                      equ 0000h
SPI2CON0_BMODE_POSITION                  equ 0000h
SPI2CON0_BMODE_SIZE                      equ 0001h
SPI2CON0_BMODE_LENGTH                    equ 0001h
SPI2CON0_BMODE_MASK                      equ 0001h
SPI2CON0_MST_POSN                        equ 0001h
SPI2CON0_MST_POSITION                    equ 0001h
SPI2CON0_MST_SIZE                        equ 0001h
SPI2CON0_MST_LENGTH                      equ 0001h
SPI2CON0_MST_MASK                        equ 0002h
SPI2CON0_LSBF_POSN                       equ 0002h
SPI2CON0_LSBF_POSITION                   equ 0002h
SPI2CON0_LSBF_SIZE                       equ 0001h
SPI2CON0_LSBF_LENGTH                     equ 0001h
SPI2CON0_LSBF_MASK                       equ 0004h
SPI2CON0_EN_POSN                         equ 0007h
SPI2CON0_EN_POSITION                     equ 0007h
SPI2CON0_EN_SIZE                         equ 0001h
SPI2CON0_EN_LENGTH                       equ 0001h
SPI2CON0_EN_MASK                         equ 0080h
SPI2CON0_SPI2BMODE_POSN                  equ 0000h
SPI2CON0_SPI2BMODE_POSITION              equ 0000h
SPI2CON0_SPI2BMODE_SIZE                  equ 0001h
SPI2CON0_SPI2BMODE_LENGTH                equ 0001h
SPI2CON0_SPI2BMODE_MASK                  equ 0001h
SPI2CON0_SPI2MST_POSN                    equ 0001h
SPI2CON0_SPI2MST_POSITION                equ 0001h
SPI2CON0_SPI2MST_SIZE                    equ 0001h
SPI2CON0_SPI2MST_LENGTH                  equ 0001h
SPI2CON0_SPI2MST_MASK                    equ 0002h
SPI2CON0_SPI2LSBF_POSN                   equ 0002h
SPI2CON0_SPI2LSBF_POSITION               equ 0002h
SPI2CON0_SPI2LSBF_SIZE                   equ 0001h
SPI2CON0_SPI2LSBF_LENGTH                 equ 0001h
SPI2CON0_SPI2LSBF_MASK                   equ 0004h
SPI2CON0_SPI2SPIEN_POSN                  equ 0007h
SPI2CON0_SPI2SPIEN_POSITION              equ 0007h
SPI2CON0_SPI2SPIEN_SIZE                  equ 0001h
SPI2CON0_SPI2SPIEN_LENGTH                equ 0001h
SPI2CON0_SPI2SPIEN_MASK                  equ 0080h

// Register: SPI2CON1
#define SPI2CON1 SPI2CON1
SPI2CON1                                 equ 0092h
// bitfield definitions
SPI2CON1_SDOP_POSN                       equ 0000h
SPI2CON1_SDOP_POSITION                   equ 0000h
SPI2CON1_SDOP_SIZE                       equ 0001h
SPI2CON1_SDOP_LENGTH                     equ 0001h
SPI2CON1_SDOP_MASK                       equ 0001h
SPI2CON1_SDIP_POSN                       equ 0001h
SPI2CON1_SDIP_POSITION                   equ 0001h
SPI2CON1_SDIP_SIZE                       equ 0001h
SPI2CON1_SDIP_LENGTH                     equ 0001h
SPI2CON1_SDIP_MASK                       equ 0002h
SPI2CON1_SSP_POSN                        equ 0002h
SPI2CON1_SSP_POSITION                    equ 0002h
SPI2CON1_SSP_SIZE                        equ 0001h
SPI2CON1_SSP_LENGTH                      equ 0001h
SPI2CON1_SSP_MASK                        equ 0004h
SPI2CON1_FST_POSN                        equ 0004h
SPI2CON1_FST_POSITION                    equ 0004h
SPI2CON1_FST_SIZE                        equ 0001h
SPI2CON1_FST_LENGTH                      equ 0001h
SPI2CON1_FST_MASK                        equ 0010h
SPI2CON1_CKP_POSN                        equ 0005h
SPI2CON1_CKP_POSITION                    equ 0005h
SPI2CON1_CKP_SIZE                        equ 0001h
SPI2CON1_CKP_LENGTH                      equ 0001h
SPI2CON1_CKP_MASK                        equ 0020h
SPI2CON1_CKE_POSN                        equ 0006h
SPI2CON1_CKE_POSITION                    equ 0006h
SPI2CON1_CKE_SIZE                        equ 0001h
SPI2CON1_CKE_LENGTH                      equ 0001h
SPI2CON1_CKE_MASK                        equ 0040h
SPI2CON1_SMP_POSN                        equ 0007h
SPI2CON1_SMP_POSITION                    equ 0007h
SPI2CON1_SMP_SIZE                        equ 0001h
SPI2CON1_SMP_LENGTH                      equ 0001h
SPI2CON1_SMP_MASK                        equ 0080h
SPI2CON1_SPI2SDOP_POSN                   equ 0000h
SPI2CON1_SPI2SDOP_POSITION               equ 0000h
SPI2CON1_SPI2SDOP_SIZE                   equ 0001h
SPI2CON1_SPI2SDOP_LENGTH                 equ 0001h
SPI2CON1_SPI2SDOP_MASK                   equ 0001h
SPI2CON1_SPI2SDIP_POSN                   equ 0001h
SPI2CON1_SPI2SDIP_POSITION               equ 0001h
SPI2CON1_SPI2SDIP_SIZE                   equ 0001h
SPI2CON1_SPI2SDIP_LENGTH                 equ 0001h
SPI2CON1_SPI2SDIP_MASK                   equ 0002h
SPI2CON1_SPI2SSP_POSN                    equ 0002h
SPI2CON1_SPI2SSP_POSITION                equ 0002h
SPI2CON1_SPI2SSP_SIZE                    equ 0001h
SPI2CON1_SPI2SSP_LENGTH                  equ 0001h
SPI2CON1_SPI2SSP_MASK                    equ 0004h
SPI2CON1_SPI2FST_POSN                    equ 0004h
SPI2CON1_SPI2FST_POSITION                equ 0004h
SPI2CON1_SPI2FST_SIZE                    equ 0001h
SPI2CON1_SPI2FST_LENGTH                  equ 0001h
SPI2CON1_SPI2FST_MASK                    equ 0010h
SPI2CON1_SPI2CKP_POSN                    equ 0005h
SPI2CON1_SPI2CKP_POSITION                equ 0005h
SPI2CON1_SPI2CKP_SIZE                    equ 0001h
SPI2CON1_SPI2CKP_LENGTH                  equ 0001h
SPI2CON1_SPI2CKP_MASK                    equ 0020h
SPI2CON1_SPI2CKE_POSN                    equ 0006h
SPI2CON1_SPI2CKE_POSITION                equ 0006h
SPI2CON1_SPI2CKE_SIZE                    equ 0001h
SPI2CON1_SPI2CKE_LENGTH                  equ 0001h
SPI2CON1_SPI2CKE_MASK                    equ 0040h
SPI2CON1_SPI2SMP_POSN                    equ 0007h
SPI2CON1_SPI2SMP_POSITION                equ 0007h
SPI2CON1_SPI2SMP_SIZE                    equ 0001h
SPI2CON1_SPI2SMP_LENGTH                  equ 0001h
SPI2CON1_SPI2SMP_MASK                    equ 0080h

// Register: SPI2CON2
#define SPI2CON2 SPI2CON2
SPI2CON2                                 equ 0093h
// bitfield definitions
SPI2CON2_RXR_POSN                        equ 0000h
SPI2CON2_RXR_POSITION                    equ 0000h
SPI2CON2_RXR_SIZE                        equ 0001h
SPI2CON2_RXR_LENGTH                      equ 0001h
SPI2CON2_RXR_MASK                        equ 0001h
SPI2CON2_TXR_POSN                        equ 0001h
SPI2CON2_TXR_POSITION                    equ 0001h
SPI2CON2_TXR_SIZE                        equ 0001h
SPI2CON2_TXR_LENGTH                      equ 0001h
SPI2CON2_TXR_MASK                        equ 0002h
SPI2CON2_SSET_POSN                       equ 0002h
SPI2CON2_SSET_POSITION                   equ 0002h
SPI2CON2_SSET_SIZE                       equ 0001h
SPI2CON2_SSET_LENGTH                     equ 0001h
SPI2CON2_SSET_MASK                       equ 0004h
SPI2CON2_SSFLT_POSN                      equ 0006h
SPI2CON2_SSFLT_POSITION                  equ 0006h
SPI2CON2_SSFLT_SIZE                      equ 0001h
SPI2CON2_SSFLT_LENGTH                    equ 0001h
SPI2CON2_SSFLT_MASK                      equ 0040h
SPI2CON2_BUSY_POSN                       equ 0007h
SPI2CON2_BUSY_POSITION                   equ 0007h
SPI2CON2_BUSY_SIZE                       equ 0001h
SPI2CON2_BUSY_LENGTH                     equ 0001h
SPI2CON2_BUSY_MASK                       equ 0080h
SPI2CON2_SPI2RXR_POSN                    equ 0000h
SPI2CON2_SPI2RXR_POSITION                equ 0000h
SPI2CON2_SPI2RXR_SIZE                    equ 0001h
SPI2CON2_SPI2RXR_LENGTH                  equ 0001h
SPI2CON2_SPI2RXR_MASK                    equ 0001h
SPI2CON2_SPI2TXR_POSN                    equ 0001h
SPI2CON2_SPI2TXR_POSITION                equ 0001h
SPI2CON2_SPI2TXR_SIZE                    equ 0001h
SPI2CON2_SPI2TXR_LENGTH                  equ 0001h
SPI2CON2_SPI2TXR_MASK                    equ 0002h
SPI2CON2_SPI2SSET_POSN                   equ 0002h
SPI2CON2_SPI2SSET_POSITION               equ 0002h
SPI2CON2_SPI2SSET_SIZE                   equ 0001h
SPI2CON2_SPI2SSET_LENGTH                 equ 0001h
SPI2CON2_SPI2SSET_MASK                   equ 0004h
SPI2CON2_SPI2SSFLT_POSN                  equ 0006h
SPI2CON2_SPI2SSFLT_POSITION              equ 0006h
SPI2CON2_SPI2SSFLT_SIZE                  equ 0001h
SPI2CON2_SPI2SSFLT_LENGTH                equ 0001h
SPI2CON2_SPI2SSFLT_MASK                  equ 0040h
SPI2CON2_SPI2BUSY_POSN                   equ 0007h
SPI2CON2_SPI2BUSY_POSITION               equ 0007h
SPI2CON2_SPI2BUSY_SIZE                   equ 0001h
SPI2CON2_SPI2BUSY_LENGTH                 equ 0001h
SPI2CON2_SPI2BUSY_MASK                   equ 0080h

