garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.inc
// Register: PORTWCLKPPS
#define PORTWCLKPPS PORTWCLKPPS
PORTWCLKPPS                              equ 027Fh
// bitfield definitions
PORTWCLKPPS_PIN_POSN                     equ 0000h
PORTWCLKPPS_PIN_POSITION                 equ 0000h
PORTWCLKPPS_PIN_SIZE                     equ 0003h
PORTWCLKPPS_PIN_LENGTH                   equ 0003h
PORTWCLKPPS_PIN_MASK                     equ 0007h
PORTWCLKPPS_PORT_POSN                    equ 0003h
PORTWCLKPPS_PORT_POSITION                equ 0003h
PORTWCLKPPS_PORT_SIZE                    equ 0003h
PORTWCLKPPS_PORT_LENGTH                  equ 0003h
PORTWCLKPPS_PORT_MASK                    equ 0038h
PORTWCLKPPS_PORTWCLKPPS_POSN             equ 0000h
PORTWCLKPPS_PORTWCLKPPS_POSITION         equ 0000h
PORTWCLKPPS_PORTWCLKPPS_SIZE             equ 0006h
PORTWCLKPPS_PORTWCLKPPS_LENGTH           equ 0006h
PORTWCLKPPS_PORTWCLKPPS_MASK             equ 003Fh
PORTWCLKPPS_PORTWCLKPPS0_POSN            equ 0000h
PORTWCLKPPS_PORTWCLKPPS0_POSITION        equ 0000h
PORTWCLKPPS_PORTWCLKPPS0_SIZE            equ 0001h
PORTWCLKPPS_PORTWCLKPPS0_LENGTH          equ 0001h
PORTWCLKPPS_PORTWCLKPPS0_MASK            equ 0001h
PORTWCLKPPS_PORTWCLKPPS1_POSN            equ 0001h
PORTWCLKPPS_PORTWCLKPPS1_POSITION        equ 0001h
PORTWCLKPPS_PORTWCLKPPS1_SIZE            equ 0001h
PORTWCLKPPS_PORTWCLKPPS1_LENGTH          equ 0001h
PORTWCLKPPS_PORTWCLKPPS1_MASK            equ 0002h
PORTWCLKPPS_PORTWCLKPPS2_POSN            equ 0002h
PORTWCLKPPS_PORTWCLKPPS2_POSITION        equ 0002h
PORTWCLKPPS_PORTWCLKPPS2_SIZE            equ 0001h
PORTWCLKPPS_PORTWCLKPPS2_LENGTH          equ 0001h
PORTWCLKPPS_PORTWCLKPPS2_MASK            equ 0004h
PORTWCLKPPS_PORTWCLKPPS3_POSN            equ 0003h
PORTWCLKPPS_PORTWCLKPPS3_POSITION        equ 0003h
PORTWCLKPPS_PORTWCLKPPS3_SIZE            equ 0001h
PORTWCLKPPS_PORTWCLKPPS3_LENGTH          equ 0001h
PORTWCLKPPS_PORTWCLKPPS3_MASK            equ 0008h
PORTWCLKPPS_PORTWCLKPPS4_POSN            equ 0004h
PORTWCLKPPS_PORTWCLKPPS4_POSITION        equ 0004h
PORTWCLKPPS_PORTWCLKPPS4_SIZE            equ 0001h
PORTWCLKPPS_PORTWCLKPPS4_LENGTH          equ 0001h
PORTWCLKPPS_PORTWCLKPPS4_MASK            equ 0010h
PORTWCLKPPS_PORTWCLKPPS5_POSN            equ 0005h
PORTWCLKPPS_PORTWCLKPPS5_POSITION        equ 0005h
PORTWCLKPPS_PORTWCLKPPS5_SIZE            equ 0001h
PORTWCLKPPS_PORTWCLKPPS5_LENGTH          equ 0001h
PORTWCLKPPS_PORTWCLKPPS5_MASK            equ 0020h

// Register: RD0I2C
#define RD0I2C RD0I2C
RD0I2C                                   equ 0282h
// bitfield definitions
RD0I2C_TH_POSN                           equ 0000h
RD0I2C_TH_POSITION                       equ 0000h
RD0I2C_TH_SIZE                           equ 0002h
RD0I2C_TH_LENGTH                         equ 0002h
RD0I2C_TH_MASK                           equ 0003h
RD0I2C_SLEW_POSN                         equ 0006h
RD0I2C_SLEW_POSITION                     equ 0006h
RD0I2C_SLEW_SIZE                         equ 0002h
RD0I2C_SLEW_LENGTH                       equ 0002h
RD0I2C_SLEW_MASK                         equ 00C0h
RD0I2C_TH0_POSN                          equ 0000h
RD0I2C_TH0_POSITION                      equ 0000h
RD0I2C_TH0_SIZE                          equ 0001h
RD0I2C_TH0_LENGTH                        equ 0001h
RD0I2C_TH0_MASK                          equ 0001h
RD0I2C_TH1_POSN                          equ 0001h
RD0I2C_TH1_POSITION                      equ 0001h
RD0I2C_TH1_SIZE                          equ 0001h
RD0I2C_TH1_LENGTH                        equ 0001h
RD0I2C_TH1_MASK                          equ 0002h
RD0I2C_SLEW0_POSN                        equ 0006h
RD0I2C_SLEW0_POSITION                    equ 0006h
RD0I2C_SLEW0_SIZE                        equ 0001h
RD0I2C_SLEW0_LENGTH                      equ 0001h
RD0I2C_SLEW0_MASK                        equ 0040h
RD0I2C_SLEW1_POSN                        equ 0007h
RD0I2C_SLEW1_POSITION                    equ 0007h
RD0I2C_SLEW1_SIZE                        equ 0001h
RD0I2C_SLEW1_LENGTH                      equ 0001h
RD0I2C_SLEW1_MASK                        equ 0080h
RD0I2C_I2CTH_POSN                        equ 0000h
RD0I2C_I2CTH_POSITION                    equ 0000h
RD0I2C_I2CTH_SIZE                        equ 0002h
RD0I2C_I2CTH_LENGTH                      equ 0002h
RD0I2C_I2CTH_MASK                        equ 0003h
RD0I2C_I2CSLEW_POSN                      equ 0006h
RD0I2C_I2CSLEW_POSITION                  equ 0006h
RD0I2C_I2CSLEW_SIZE                      equ 0002h
RD0I2C_I2CSLEW_LENGTH                    equ 0002h
RD0I2C_I2CSLEW_MASK                      equ 00C0h
RD0I2C_I2CTH0_POSN                       equ 0000h
RD0I2C_I2CTH0_POSITION                   equ 0000h
RD0I2C_I2CTH0_SIZE                       equ 0001h
RD0I2C_I2CTH0_LENGTH                     equ 0001h
RD0I2C_I2CTH0_MASK                       equ 0001h
RD0I2C_I2CTH1_POSN                       equ 0001h
RD0I2C_I2CTH1_POSITION                   equ 0001h
RD0I2C_I2CTH1_SIZE                       equ 0001h
RD0I2C_I2CTH1_LENGTH                     equ 0001h
RD0I2C_I2CTH1_MASK                       equ 0002h
RD0I2C_I2CSLEW0_POSN                     equ 0006h
RD0I2C_I2CSLEW0_POSITION                 equ 0006h
RD0I2C_I2CSLEW0_SIZE                     equ 0001h
RD0I2C_I2CSLEW0_LENGTH                   equ 0001h
RD0I2C_I2CSLEW0_MASK                     equ 0040h
RD0I2C_I2CSLEW1_POSN                     equ 0007h
RD0I2C_I2CSLEW1_POSITION                 equ 0007h
RD0I2C_I2CSLEW1_SIZE                     equ 0001h
RD0I2C_I2CSLEW1_LENGTH                   equ 0001h
RD0I2C_I2CSLEW1_MASK                     equ 0080h

// Register: RD1I2C
#define RD1I2C RD1I2C
RD1I2C                                   equ 0283h
// bitfield definitions
RD1I2C_TH_POSN                           equ 0000h
RD1I2C_TH_POSITION                       equ 0000h
RD1I2C_TH_SIZE                           equ 0002h
RD1I2C_TH_LENGTH                         equ 0002h
RD1I2C_TH_MASK                           equ 0003h
RD1I2C_SLEW_POSN                         equ 0006h
RD1I2C_SLEW_POSITION                     equ 0006h
RD1I2C_SLEW_SIZE                         equ 0002h
RD1I2C_SLEW_LENGTH                       equ 0002h
RD1I2C_SLEW_MASK                         equ 00C0h
RD1I2C_TH0_POSN                          equ 0000h
RD1I2C_TH0_POSITION                      equ 0000h
RD1I2C_TH0_SIZE                          equ 0001h
RD1I2C_TH0_LENGTH                        equ 0001h
RD1I2C_TH0_MASK                          equ 0001h
RD1I2C_TH1_POSN                          equ 0001h
RD1I2C_TH1_POSITION                      equ 0001h
RD1I2C_TH1_SIZE                          equ 0001h
RD1I2C_TH1_LENGTH                        equ 0001h
RD1I2C_TH1_MASK                          equ 0002h
RD1I2C_SLEW0_POSN                        equ 0006h
RD1I2C_SLEW0_POSITION                    equ 0006h
RD1I2C_SLEW0_SIZE                        equ 0001h
RD1I2C_SLEW0_LENGTH                      equ 0001h
RD1I2C_SLEW0_MASK                        equ 0040h
RD1I2C_SLEW1_POSN                        equ 0007h
RD1I2C_SLEW1_POSITION                    equ 0007h
RD1I2C_SLEW1_SIZE                        equ 0001h
RD1I2C_SLEW1_LENGTH                      equ 0001h
RD1I2C_SLEW1_MASK                        equ 0080h
RD1I2C_I2CTH_POSN                        equ 0000h
RD1I2C_I2CTH_POSITION                    equ 0000h
RD1I2C_I2CTH_SIZE                        equ 0002h
RD1I2C_I2CTH_LENGTH                      equ 0002h
RD1I2C_I2CTH_MASK                        equ 0003h
RD1I2C_I2CSLEW_POSN                      equ 0006h
RD1I2C_I2CSLEW_POSITION                  equ 0006h
RD1I2C_I2CSLEW_SIZE                      equ 0002h
RD1I2C_I2CSLEW_LENGTH                    equ 0002h
RD1I2C_I2CSLEW_MASK                      equ 00C0h
RD1I2C_I2CTH0_POSN                       equ 0000h
RD1I2C_I2CTH0_POSITION                   equ 0000h
RD1I2C_I2CTH0_SIZE                       equ 0001h
RD1I2C_I2CTH0_LENGTH                     equ 0001h
RD1I2C_I2CTH0_MASK                       equ 0001h
RD1I2C_I2CTH1_POSN                       equ 0001h
RD1I2C_I2CTH1_POSITION                   equ 0001h
RD1I2C_I2CTH1_SIZE                       equ 0001h
RD1I2C_I2CTH1_LENGTH                     equ 0001h
RD1I2C_I2CTH1_MASK                       equ 0002h
RD1I2C_I2CSLEW0_POSN                     equ 0006h
RD1I2C_I2CSLEW0_POSITION                 equ 0006h
RD1I2C_I2CSLEW0_SIZE                     equ 0001h
RD1I2C_I2CSLEW0_LENGTH                   equ 0001h
RD1I2C_I2CSLEW0_MASK                     equ 0040h
RD1I2C_I2CSLEW1_POSN                     equ 0007h
RD1I2C_I2CSLEW1_POSITION                 equ 0007h
RD1I2C_I2CSLEW1_SIZE                     equ 0001h
RD1I2C_I2CSLEW1_LENGTH                   equ 0001h
RD1I2C_I2CSLEW1_MASK                     equ 0080h

// Register: RC3I2C
#define RC3I2C RC3I2C
RC3I2C                                   equ 0284h
// bitfield definitions
RC3I2C_TH_POSN                           equ 0000h
RC3I2C_TH_POSITION                       equ 0000h
RC3I2C_TH_SIZE                           equ 0002h
RC3I2C_TH_LENGTH                         equ 0002h
RC3I2C_TH_MASK                           equ 0003h
RC3I2C_SLEW_POSN                         equ 0006h
RC3I2C_SLEW_POSITION                     equ 0006h
RC3I2C_SLEW_SIZE                         equ 0002h
RC3I2C_SLEW_LENGTH                       equ 0002h
RC3I2C_SLEW_MASK                         equ 00C0h
RC3I2C_TH0_POSN                          equ 0000h
RC3I2C_TH0_POSITION                      equ 0000h
RC3I2C_TH0_SIZE                          equ 0001h
RC3I2C_TH0_LENGTH                        equ 0001h
RC3I2C_TH0_MASK                          equ 0001h
RC3I2C_TH1_POSN                          equ 0001h
RC3I2C_TH1_POSITION                      equ 0001h
RC3I2C_TH1_SIZE                          equ 0001h
RC3I2C_TH1_LENGTH                        equ 0001h
RC3I2C_TH1_MASK                          equ 0002h
RC3I2C_SLEW0_POSN                        equ 0006h
RC3I2C_SLEW0_POSITION                    equ 0006h
RC3I2C_SLEW0_SIZE                        equ 0001h
RC3I2C_SLEW0_LENGTH                      equ 0001h
RC3I2C_SLEW0_MASK                        equ 0040h
RC3I2C_SLEW1_POSN                        equ 0007h
RC3I2C_SLEW1_POSITION                    equ 0007h
RC3I2C_SLEW1_SIZE                        equ 0001h
RC3I2C_SLEW1_LENGTH                      equ 0001h
RC3I2C_SLEW1_MASK                        equ 0080h
RC3I2C_I2CTH_POSN                        equ 0000h
RC3I2C_I2CTH_POSITION                    equ 0000h
RC3I2C_I2CTH_SIZE                        equ 0002h
RC3I2C_I2CTH_LENGTH                      equ 0002h
RC3I2C_I2CTH_MASK                        equ 0003h
RC3I2C_I2CSLEW_POSN                      equ 0006h
RC3I2C_I2CSLEW_POSITION                  equ 0006h
RC3I2C_I2CSLEW_SIZE                      equ 0002h
RC3I2C_I2CSLEW_LENGTH                    equ 0002h
RC3I2C_I2CSLEW_MASK                      equ 00C0h
RC3I2C_I2CTH0_POSN                       equ 0000h
RC3I2C_I2CTH0_POSITION                   equ 0000h
RC3I2C_I2CTH0_SIZE                       equ 0001h
RC3I2C_I2CTH0_LENGTH                     equ 0001h
RC3I2C_I2CTH0_MASK                       equ 0001h
RC3I2C_I2CTH1_POSN                       equ 0001h
RC3I2C_I2CTH1_POSITION                   equ 0001h
RC3I2C_I2CTH1_SIZE                       equ 0001h
RC3I2C_I2CTH1_LENGTH                     equ 0001h
RC3I2C_I2CTH1_MASK                       equ 0002h
RC3I2C_I2CSLEW0_POSN                     equ 0006h
RC3I2C_I2CSLEW0_POSITION                 equ 0006h
RC3I2C_I2CSLEW0_SIZE                     equ 0001h
RC3I2C_I2CSLEW0_LENGTH                   equ 0001h
RC3I2C_I2CSLEW0_MASK                     equ 0040h
RC3I2C_I2CSLEW1_POSN                     equ 0007h
RC3I2C_I2CSLEW1_POSITION                 equ 0007h
RC3I2C_I2CSLEW1_SIZE                     equ 0001h
RC3I2C_I2CSLEW1_LENGTH                   equ 0001h
RC3I2C_I2CSLEW1_MASK                     equ 0080h

// Register: RC4I2C
#define RC4I2C RC4I2C
RC4I2C                                   equ 0285h
// bitfield definitions
RC4I2C_TH_POSN                           equ 0000h
RC4I2C_TH_POSITION                       equ 0000h
RC4I2C_TH_SIZE                           equ 0002h
RC4I2C_TH_LENGTH                         equ 0002h
RC4I2C_TH_MASK                           equ 0003h
RC4I2C_SLEW_POSN                         equ 0006h
RC4I2C_SLEW_POSITION                     equ 0006h
RC4I2C_SLEW_SIZE                         equ 0002h
RC4I2C_SLEW_LENGTH                       equ 0002h
RC4I2C_SLEW_MASK                         equ 00C0h
RC4I2C_TH0_POSN                          equ 0000h
RC4I2C_TH0_POSITION                      equ 0000h
RC4I2C_TH0_SIZE                          equ 0001h
RC4I2C_TH0_LENGTH                        equ 0001h
RC4I2C_TH0_MASK                          equ 0001h
RC4I2C_TH1_POSN                          equ 0001h
RC4I2C_TH1_POSITION                      equ 0001h
RC4I2C_TH1_SIZE                          equ 0001h
RC4I2C_TH1_LENGTH                        equ 0001h
RC4I2C_TH1_MASK                          equ 0002h
RC4I2C_SLEW0_POSN                        equ 0006h
RC4I2C_SLEW0_POSITION                    equ 0006h
RC4I2C_SLEW0_SIZE                        equ 0001h
RC4I2C_SLEW0_LENGTH                      equ 0001h
RC4I2C_SLEW0_MASK                        equ 0040h
RC4I2C_SLEW1_POSN                        equ 0007h
RC4I2C_SLEW1_POSITION                    equ 0007h
RC4I2C_SLEW1_SIZE                        equ 0001h
RC4I2C_SLEW1_LENGTH                      equ 0001h
RC4I2C_SLEW1_MASK                        equ 0080h
RC4I2C_I2CTH_POSN                        equ 0000h
RC4I2C_I2CTH_POSITION                    equ 0000h
RC4I2C_I2CTH_SIZE                        equ 0002h
RC4I2C_I2CTH_LENGTH                      equ 0002h
RC4I2C_I2CTH_MASK                        equ 0003h
RC4I2C_I2CSLEW_POSN                      equ 0006h
RC4I2C_I2CSLEW_POSITION                  equ 0006h
RC4I2C_I2CSLEW_SIZE                      equ 0002h
RC4I2C_I2CSLEW_LENGTH                    equ 0002h
RC4I2C_I2CSLEW_MASK                      equ 00C0h
RC4I2C_I2CTH0_POSN                       equ 0000h
RC4I2C_I2CTH0_POSITION                   equ 0000h
RC4I2C_I2CTH0_SIZE                       equ 0001h
RC4I2C_I2CTH0_LENGTH                     equ 0001h
RC4I2C_I2CTH0_MASK                       equ 0001h
RC4I2C_I2CTH1_POSN                       equ 0001h
RC4I2C_I2CTH1_POSITION                   equ 0001h
RC4I2C_I2CTH1_SIZE                       equ 0001h
RC4I2C_I2CTH1_LENGTH                     equ 0001h
RC4I2C_I2CTH1_MASK                       equ 0002h
RC4I2C_I2CSLEW0_POSN                     equ 0006h
RC4I2C_I2CSLEW0_POSITION                 equ 0006h
RC4I2C_I2CSLEW0_SIZE                     equ 0001h
RC4I2C_I2CSLEW0_LENGTH                   equ 0001h
RC4I2C_I2CSLEW0_MASK                     equ 0040h
RC4I2C_I2CSLEW1_POSN                     equ 0007h
RC4I2C_I2CSLEW1_POSITION                 equ 0007h
RC4I2C_I2CSLEW1_SIZE                     equ 0001h
RC4I2C_I2CSLEW1_LENGTH                   equ 0001h
RC4I2C_I2CSLEW1_MASK                     equ 0080h

// Register: RB1I2C
#define RB1I2C RB1I2C
RB1I2C                                   equ 0286h
// bitfield definitions
RB1I2C_TH_POSN                           equ 0000h
RB1I2C_TH_POSITION                       equ 0000h
RB1I2C_TH_SIZE                           equ 0002h
RB1I2C_TH_LENGTH                         equ 0002h
RB1I2C_TH_MASK                           equ 0003h
RB1I2C_PU_POSN                           equ 0004h
RB1I2C_PU_POSITION                       equ 0004h
RB1I2C_PU_SIZE                           equ 0002h
RB1I2C_PU_LENGTH                         equ 0002h
RB1I2C_PU_MASK                           equ 0030h
RB1I2C_SLEW_POSN                         equ 0006h
RB1I2C_SLEW_POSITION                     equ 0006h
RB1I2C_SLEW_SIZE                         equ 0002h
RB1I2C_SLEW_LENGTH                       equ 0002h
RB1I2C_SLEW_MASK                         equ 00C0h
RB1I2C_TH0_POSN                          equ 0000h
RB1I2C_TH0_POSITION                      equ 0000h
RB1I2C_TH0_SIZE                          equ 0001h
RB1I2C_TH0_LENGTH                        equ 0001h
RB1I2C_TH0_MASK                          equ 0001h
RB1I2C_TH1_POSN                          equ 0001h
RB1I2C_TH1_POSITION                      equ 0001h
RB1I2C_TH1_SIZE                          equ 0001h
RB1I2C_TH1_LENGTH                        equ 0001h
RB1I2C_TH1_MASK                          equ 0002h
RB1I2C_PU0_POSN                          equ 0004h
RB1I2C_PU0_POSITION                      equ 0004h
RB1I2C_PU0_SIZE                          equ 0001h
RB1I2C_PU0_LENGTH                        equ 0001h
RB1I2C_PU0_MASK                          equ 0010h
RB1I2C_PU1_POSN                          equ 0005h
RB1I2C_PU1_POSITION                      equ 0005h
RB1I2C_PU1_SIZE                          equ 0001h
RB1I2C_PU1_LENGTH                        equ 0001h
RB1I2C_PU1_MASK                          equ 0020h
RB1I2C_SLEW0_POSN                        equ 0006h
RB1I2C_SLEW0_POSITION                    equ 0006h
RB1I2C_SLEW0_SIZE                        equ 0001h
RB1I2C_SLEW0_LENGTH                      equ 0001h
RB1I2C_SLEW0_MASK                        equ 0040h
RB1I2C_SLEW1_POSN                        equ 0007h
RB1I2C_SLEW1_POSITION                    equ 0007h
RB1I2C_SLEW1_SIZE                        equ 0001h
RB1I2C_SLEW1_LENGTH                      equ 0001h
RB1I2C_SLEW1_MASK                        equ 0080h
RB1I2C_I2CTH_POSN                        equ 0000h
RB1I2C_I2CTH_POSITION                    equ 0000h
RB1I2C_I2CTH_SIZE                        equ 0002h
RB1I2C_I2CTH_LENGTH                      equ 0002h
RB1I2C_I2CTH_MASK                        equ 0003h
RB1I2C_I2CPU_POSN                        equ 0004h
RB1I2C_I2CPU_POSITION                    equ 0004h
RB1I2C_I2CPU_SIZE                        equ 0002h
RB1I2C_I2CPU_LENGTH                      equ 0002h
RB1I2C_I2CPU_MASK                        equ 0030h
RB1I2C_I2CSLEW_POSN                      equ 0006h
RB1I2C_I2CSLEW_POSITION                  equ 0006h
RB1I2C_I2CSLEW_SIZE                      equ 0002h
RB1I2C_I2CSLEW_LENGTH                    equ 0002h
RB1I2C_I2CSLEW_MASK                      equ 00C0h
RB1I2C_I2CTH0_POSN                       equ 0000h
RB1I2C_I2CTH0_POSITION                   equ 0000h
RB1I2C_I2CTH0_SIZE                       equ 0001h
RB1I2C_I2CTH0_LENGTH                     equ 0001h
RB1I2C_I2CTH0_MASK                       equ 0001h
RB1I2C_I2CTH1_POSN                       equ 0001h
RB1I2C_I2CTH1_POSITION                   equ 0001h
RB1I2C_I2CTH1_SIZE                       equ 0001h
RB1I2C_I2CTH1_LENGTH                     equ 0001h
RB1I2C_I2CTH1_MASK                       equ 0002h
RB1I2C_I2CPU0_POSN                       equ 0004h
RB1I2C_I2CPU0_POSITION                   equ 0004h
RB1I2C_I2CPU0_SIZE                       equ 0001h
RB1I2C_I2CPU0_LENGTH                     equ 0001h
RB1I2C_I2CPU0_MASK                       equ 0010h
RB1I2C_I2CPU1_POSN                       equ 0005h
RB1I2C_I2CPU1_POSITION                   equ 0005h
RB1I2C_I2CPU1_SIZE                       equ 0001h
RB1I2C_I2CPU1_LENGTH                     equ 0001h
RB1I2C_I2CPU1_MASK                       equ 0020h
RB1I2C_I2CSLEW0_POSN                     equ 0006h
RB1I2C_I2CSLEW0_POSITION                 equ 0006h
RB1I2C_I2CSLEW0_SIZE                     equ 0001h
RB1I2C_I2CSLEW0_LENGTH                   equ 0001h
RB1I2C_I2CSLEW0_MASK                     equ 0040h
RB1I2C_I2CSLEW1_POSN                     equ 0007h
RB1I2C_I2CSLEW1_POSITION                 equ 0007h
RB1I2C_I2CSLEW1_SIZE                     equ 0001h
RB1I2C_I2CSLEW1_LENGTH                   equ 0001h
RB1I2C_I2CSLEW1_MASK                     equ 0080h

