garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.inc
// Register: TU16BCLK
#define TU16BCLK TU16BCLK
TU16BCLK                                 equ 03B7h
// bitfield definitions
TU16BCLK_CLK_POSN                        equ 0000h
TU16BCLK_CLK_POSITION                    equ 0000h
TU16BCLK_CLK_SIZE                        equ 0008h
TU16BCLK_CLK_LENGTH                      equ 0008h
TU16BCLK_CLK_MASK                        equ 00FFh
TU16BCLK_CLK0_POSN                       equ 0000h
TU16BCLK_CLK0_POSITION                   equ 0000h
TU16BCLK_CLK0_SIZE                       equ 0001h
TU16BCLK_CLK0_LENGTH                     equ 0001h
TU16BCLK_CLK0_MASK                       equ 0001h
TU16BCLK_CLK1_POSN                       equ 0001h
TU16BCLK_CLK1_POSITION                   equ 0001h
TU16BCLK_CLK1_SIZE                       equ 0001h
TU16BCLK_CLK1_LENGTH                     equ 0001h
TU16BCLK_CLK1_MASK                       equ 0002h
TU16BCLK_CLK2_POSN                       equ 0002h
TU16BCLK_CLK2_POSITION                   equ 0002h
TU16BCLK_CLK2_SIZE                       equ 0001h
TU16BCLK_CLK2_LENGTH                     equ 0001h
TU16BCLK_CLK2_MASK                       equ 0004h
TU16BCLK_CLK3_POSN                       equ 0003h
TU16BCLK_CLK3_POSITION                   equ 0003h
TU16BCLK_CLK3_SIZE                       equ 0001h
TU16BCLK_CLK3_LENGTH                     equ 0001h
TU16BCLK_CLK3_MASK                       equ 0008h
TU16BCLK_CLK4_POSN                       equ 0004h
TU16BCLK_CLK4_POSITION                   equ 0004h
TU16BCLK_CLK4_SIZE                       equ 0001h
TU16BCLK_CLK4_LENGTH                     equ 0001h
TU16BCLK_CLK4_MASK                       equ 0010h
TU16BCLK_TU16BCLK0_POSN                  equ 0000h
TU16BCLK_TU16BCLK0_POSITION              equ 0000h
TU16BCLK_TU16BCLK0_SIZE                  equ 0001h
TU16BCLK_TU16BCLK0_LENGTH                equ 0001h
TU16BCLK_TU16BCLK0_MASK                  equ 0001h
TU16BCLK_TU16BCLK1_POSN                  equ 0001h
TU16BCLK_TU16BCLK1_POSITION              equ 0001h
TU16BCLK_TU16BCLK1_SIZE                  equ 0001h
TU16BCLK_TU16BCLK1_LENGTH                equ 0001h
TU16BCLK_TU16BCLK1_MASK                  equ 0002h
TU16BCLK_TU16BCLK2_POSN                  equ 0002h
TU16BCLK_TU16BCLK2_POSITION              equ 0002h
TU16BCLK_TU16BCLK2_SIZE                  equ 0001h
TU16BCLK_TU16BCLK2_LENGTH                equ 0001h
TU16BCLK_TU16BCLK2_MASK                  equ 0004h
TU16BCLK_TU16BCLK3_POSN                  equ 0003h
TU16BCLK_TU16BCLK3_POSITION              equ 0003h
TU16BCLK_TU16BCLK3_SIZE                  equ 0001h
TU16BCLK_TU16BCLK3_LENGTH                equ 0001h
TU16BCLK_TU16BCLK3_MASK                  equ 0008h
TU16BCLK_TU16BCLK4_POSN                  equ 0004h
TU16BCLK_TU16BCLK4_POSITION              equ 0004h
TU16BCLK_TU16BCLK4_SIZE                  equ 0001h
TU16BCLK_TU16BCLK4_LENGTH                equ 0001h
TU16BCLK_TU16BCLK4_MASK                  equ 0010h

// Register: TU16BERS
#define TU16BERS TU16BERS
TU16BERS                                 equ 03B8h
// bitfield definitions
TU16BERS_ERS_POSN                        equ 0000h
TU16BERS_ERS_POSITION                    equ 0000h
TU16BERS_ERS_SIZE                        equ 0008h
TU16BERS_ERS_LENGTH                      equ 0008h
TU16BERS_ERS_MASK                        equ 00FFh
TU16BERS_ERS0_POSN                       equ 0000h
TU16BERS_ERS0_POSITION                   equ 0000h
TU16BERS_ERS0_SIZE                       equ 0001h
TU16BERS_ERS0_LENGTH                     equ 0001h
TU16BERS_ERS0_MASK                       equ 0001h
TU16BERS_ERS1_POSN                       equ 0001h
TU16BERS_ERS1_POSITION                   equ 0001h
TU16BERS_ERS1_SIZE                       equ 0001h
TU16BERS_ERS1_LENGTH                     equ 0001h
TU16BERS_ERS1_MASK                       equ 0002h
TU16BERS_ERS2_POSN                       equ 0002h
TU16BERS_ERS2_POSITION                   equ 0002h
TU16BERS_ERS2_SIZE                       equ 0001h
TU16BERS_ERS2_LENGTH                     equ 0001h
TU16BERS_ERS2_MASK                       equ 0004h
TU16BERS_ERS3_POSN                       equ 0003h
TU16BERS_ERS3_POSITION                   equ 0003h
TU16BERS_ERS3_SIZE                       equ 0001h
TU16BERS_ERS3_LENGTH                     equ 0001h
TU16BERS_ERS3_MASK                       equ 0008h
TU16BERS_ERS4_POSN                       equ 0004h
TU16BERS_ERS4_POSITION                   equ 0004h
TU16BERS_ERS4_SIZE                       equ 0001h
TU16BERS_ERS4_LENGTH                     equ 0001h
TU16BERS_ERS4_MASK                       equ 0010h
TU16BERS_ERS5_POSN                       equ 0005h
TU16BERS_ERS5_POSITION                   equ 0005h
TU16BERS_ERS5_SIZE                       equ 0001h
TU16BERS_ERS5_LENGTH                     equ 0001h
TU16BERS_ERS5_MASK                       equ 0020h
TU16BERS_TU16BERS0_POSN                  equ 0000h
TU16BERS_TU16BERS0_POSITION              equ 0000h
TU16BERS_TU16BERS0_SIZE                  equ 0001h
TU16BERS_TU16BERS0_LENGTH                equ 0001h
TU16BERS_TU16BERS0_MASK                  equ 0001h
TU16BERS_TU16BERS1_POSN                  equ 0001h
TU16BERS_TU16BERS1_POSITION              equ 0001h
TU16BERS_TU16BERS1_SIZE                  equ 0001h
TU16BERS_TU16BERS1_LENGTH                equ 0001h
TU16BERS_TU16BERS1_MASK                  equ 0002h
TU16BERS_TU16BERS2_POSN                  equ 0002h
TU16BERS_TU16BERS2_POSITION              equ 0002h
TU16BERS_TU16BERS2_SIZE                  equ 0001h
TU16BERS_TU16BERS2_LENGTH                equ 0001h
TU16BERS_TU16BERS2_MASK                  equ 0004h
TU16BERS_TU16BERS3_POSN                  equ 0003h
TU16BERS_TU16BERS3_POSITION              equ 0003h
TU16BERS_TU16BERS3_SIZE                  equ 0001h
TU16BERS_TU16BERS3_LENGTH                equ 0001h
TU16BERS_TU16BERS3_MASK                  equ 0008h
TU16BERS_TU16BERS4_POSN                  equ 0004h
TU16BERS_TU16BERS4_POSITION              equ 0004h
TU16BERS_TU16BERS4_SIZE                  equ 0001h
TU16BERS_TU16BERS4_LENGTH                equ 0001h
TU16BERS_TU16BERS4_MASK                  equ 0010h
TU16BERS_TU16BERS5_POSN                  equ 0005h
TU16BERS_TU16BERS5_POSITION              equ 0005h
TU16BERS_TU16BERS5_SIZE                  equ 0001h
TU16BERS_TU16BERS5_LENGTH                equ 0001h
TU16BERS_TU16BERS5_MASK                  equ 0020h

// Register: TUCHAIN
#define TUCHAIN TUCHAIN
TUCHAIN                                  equ 03B9h
// bitfield definitions
TUCHAIN_CH16AB_POSN                      equ 0000h
TUCHAIN_CH16AB_POSITION                  equ 0000h
TUCHAIN_CH16AB_SIZE                      equ 0001h
TUCHAIN_CH16AB_LENGTH                    equ 0001h
TUCHAIN_CH16AB_MASK                      equ 0001h

