garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.inc
// Register: ADACCL
#define ADACCL ADACCL
ADACCL                                   equ 03E3h
// bitfield definitions
ADACCL_ACC_POSN                          equ 0000h
ADACCL_ACC_POSITION                      equ 0000h
ADACCL_ACC_SIZE                          equ 0008h
ADACCL_ACC_LENGTH                        equ 0008h
ADACCL_ACC_MASK                          equ 00FFh
ADACCL_ADACC0_POSN                       equ 0000h
ADACCL_ADACC0_POSITION                   equ 0000h
ADACCL_ADACC0_SIZE                       equ 0001h
ADACCL_ADACC0_LENGTH                     equ 0001h
ADACCL_ADACC0_MASK                       equ 0001h
ADACCL_ADACC1_POSN                       equ 0001h
ADACCL_ADACC1_POSITION                   equ 0001h
ADACCL_ADACC1_SIZE                       equ 0001h
ADACCL_ADACC1_LENGTH                     equ 0001h
ADACCL_ADACC1_MASK                       equ 0002h
ADACCL_ADACC2_POSN                       equ 0002h
ADACCL_ADACC2_POSITION                   equ 0002h
ADACCL_ADACC2_SIZE                       equ 0001h
ADACCL_ADACC2_LENGTH                     equ 0001h
ADACCL_ADACC2_MASK                       equ 0004h
ADACCL_ADACC3_POSN                       equ 0003h
ADACCL_ADACC3_POSITION                   equ 0003h
ADACCL_ADACC3_SIZE                       equ 0001h
ADACCL_ADACC3_LENGTH                     equ 0001h
ADACCL_ADACC3_MASK                       equ 0008h
ADACCL_ADACC4_POSN                       equ 0004h
ADACCL_ADACC4_POSITION                   equ 0004h
ADACCL_ADACC4_SIZE                       equ 0001h
ADACCL_ADACC4_LENGTH                     equ 0001h
ADACCL_ADACC4_MASK                       equ 0010h
ADACCL_ADACC5_POSN                       equ 0005h
ADACCL_ADACC5_POSITION                   equ 0005h
ADACCL_ADACC5_SIZE                       equ 0001h
ADACCL_ADACC5_LENGTH                     equ 0001h
ADACCL_ADACC5_MASK                       equ 0020h
ADACCL_ADACC6_POSN                       equ 0006h
ADACCL_ADACC6_POSITION                   equ 0006h
ADACCL_ADACC6_SIZE                       equ 0001h
ADACCL_ADACC6_LENGTH                     equ 0001h
ADACCL_ADACC6_MASK                       equ 0040h
ADACCL_ADACC7_POSN                       equ 0007h
ADACCL_ADACC7_POSITION                   equ 0007h
ADACCL_ADACC7_SIZE                       equ 0001h
ADACCL_ADACC7_LENGTH                     equ 0001h
ADACCL_ADACC7_MASK                       equ 0080h
ADACCL_ADACC_POSN                        equ 0000h
ADACCL_ADACC_POSITION                    equ 0000h
ADACCL_ADACC_SIZE                        equ 0008h
ADACCL_ADACC_LENGTH                      equ 0008h
ADACCL_ADACC_MASK                        equ 00FFh
ADACCL_ACC0_POSN                         equ 0000h
ADACCL_ACC0_POSITION                     equ 0000h
ADACCL_ACC0_SIZE                         equ 0001h
ADACCL_ACC0_LENGTH                       equ 0001h
ADACCL_ACC0_MASK                         equ 0001h
ADACCL_ACC1_POSN                         equ 0001h
ADACCL_ACC1_POSITION                     equ 0001h
ADACCL_ACC1_SIZE                         equ 0001h
ADACCL_ACC1_LENGTH                       equ 0001h
ADACCL_ACC1_MASK                         equ 0002h
ADACCL_ACC2_POSN                         equ 0002h
ADACCL_ACC2_POSITION                     equ 0002h
ADACCL_ACC2_SIZE                         equ 0001h
ADACCL_ACC2_LENGTH                       equ 0001h
ADACCL_ACC2_MASK                         equ 0004h
ADACCL_ACC3_POSN                         equ 0003h
ADACCL_ACC3_POSITION                     equ 0003h
ADACCL_ACC3_SIZE                         equ 0001h
ADACCL_ACC3_LENGTH                       equ 0001h
ADACCL_ACC3_MASK                         equ 0008h
ADACCL_ACC4_POSN                         equ 0004h
ADACCL_ACC4_POSITION                     equ 0004h
ADACCL_ACC4_SIZE                         equ 0001h
ADACCL_ACC4_LENGTH                       equ 0001h
ADACCL_ACC4_MASK                         equ 0010h
ADACCL_ACC5_POSN                         equ 0005h
ADACCL_ACC5_POSITION                     equ 0005h
ADACCL_ACC5_SIZE                         equ 0001h
ADACCL_ACC5_LENGTH                       equ 0001h
ADACCL_ACC5_MASK                         equ 0020h
ADACCL_ACC6_POSN                         equ 0006h
ADACCL_ACC6_POSITION                     equ 0006h
ADACCL_ACC6_SIZE                         equ 0001h
ADACCL_ACC6_LENGTH                       equ 0001h
ADACCL_ACC6_MASK                         equ 0040h
ADACCL_ACC7_POSN                         equ 0007h
ADACCL_ACC7_POSITION                     equ 0007h
ADACCL_ACC7_SIZE                         equ 0001h
ADACCL_ACC7_LENGTH                       equ 0001h
ADACCL_ACC7_MASK                         equ 0080h

// Register: ADACCH
#define ADACCH ADACCH
ADACCH                                   equ 03E4h
// bitfield definitions
ADACCH_ACC_POSN                          equ 0000h
ADACCH_ACC_POSITION                      equ 0000h
ADACCH_ACC_SIZE                          equ 0008h
ADACCH_ACC_LENGTH                        equ 0008h
ADACCH_ACC_MASK                          equ 00FFh
ADACCH_ADACC8_POSN                       equ 0000h
ADACCH_ADACC8_POSITION                   equ 0000h
ADACCH_ADACC8_SIZE                       equ 0001h
ADACCH_ADACC8_LENGTH                     equ 0001h
ADACCH_ADACC8_MASK                       equ 0001h
ADACCH_ADACC9_POSN                       equ 0001h
ADACCH_ADACC9_POSITION                   equ 0001h
ADACCH_ADACC9_SIZE                       equ 0001h
ADACCH_ADACC9_LENGTH                     equ 0001h
ADACCH_ADACC9_MASK                       equ 0002h
ADACCH_ADACC10_POSN                      equ 0002h
ADACCH_ADACC10_POSITION                  equ 0002h
ADACCH_ADACC10_SIZE                      equ 0001h
ADACCH_ADACC10_LENGTH                    equ 0001h
ADACCH_ADACC10_MASK                      equ 0004h
ADACCH_ADACC11_POSN                      equ 0003h
ADACCH_ADACC11_POSITION                  equ 0003h
ADACCH_ADACC11_SIZE                      equ 0001h
ADACCH_ADACC11_LENGTH                    equ 0001h
ADACCH_ADACC11_MASK                      equ 0008h
ADACCH_ADACC12_POSN                      equ 0004h
ADACCH_ADACC12_POSITION                  equ 0004h
ADACCH_ADACC12_SIZE                      equ 0001h
ADACCH_ADACC12_LENGTH                    equ 0001h
ADACCH_ADACC12_MASK                      equ 0010h
ADACCH_ADACC13_POSN                      equ 0005h
ADACCH_ADACC13_POSITION                  equ 0005h
ADACCH_ADACC13_SIZE                      equ 0001h
ADACCH_ADACC13_LENGTH                    equ 0001h
ADACCH_ADACC13_MASK                      equ 0020h
ADACCH_ADACC14_POSN                      equ 0006h
ADACCH_ADACC14_POSITION                  equ 0006h
ADACCH_ADACC14_SIZE                      equ 0001h
ADACCH_ADACC14_LENGTH                    equ 0001h
ADACCH_ADACC14_MASK                      equ 0040h
ADACCH_ADACC15_POSN                      equ 0007h
ADACCH_ADACC15_POSITION                  equ 0007h
ADACCH_ADACC15_SIZE                      equ 0001h
ADACCH_ADACC15_LENGTH                    equ 0001h
ADACCH_ADACC15_MASK                      equ 0080h
ADACCH_ADACC_POSN                        equ 0000h
ADACCH_ADACC_POSITION                    equ 0000h
ADACCH_ADACC_SIZE                        equ 0008h
ADACCH_ADACC_LENGTH                      equ 0008h
ADACCH_ADACC_MASK                        equ 00FFh
ADACCH_ACC8_POSN                         equ 0000h
ADACCH_ACC8_POSITION                     equ 0000h
ADACCH_ACC8_SIZE                         equ 0001h
ADACCH_ACC8_LENGTH                       equ 0001h
ADACCH_ACC8_MASK                         equ 0001h
ADACCH_ACC9_POSN                         equ 0001h
ADACCH_ACC9_POSITION                     equ 0001h
ADACCH_ACC9_SIZE                         equ 0001h
ADACCH_ACC9_LENGTH                       equ 0001h
ADACCH_ACC9_MASK                         equ 0002h
ADACCH_ACC10_POSN                        equ 0002h
ADACCH_ACC10_POSITION                    equ 0002h
ADACCH_ACC10_SIZE                        equ 0001h
ADACCH_ACC10_LENGTH                      equ 0001h
ADACCH_ACC10_MASK                        equ 0004h
ADACCH_ACC11_POSN                        equ 0003h
ADACCH_ACC11_POSITION                    equ 0003h
ADACCH_ACC11_SIZE                        equ 0001h
ADACCH_ACC11_LENGTH                      equ 0001h
ADACCH_ACC11_MASK                        equ 0008h
ADACCH_ACC12_POSN                        equ 0004h
ADACCH_ACC12_POSITION                    equ 0004h
ADACCH_ACC12_SIZE                        equ 0001h
ADACCH_ACC12_LENGTH                      equ 0001h
ADACCH_ACC12_MASK                        equ 0010h
ADACCH_ACC13_POSN                        equ 0005h
ADACCH_ACC13_POSITION                    equ 0005h
ADACCH_ACC13_SIZE                        equ 0001h
ADACCH_ACC13_LENGTH                      equ 0001h
ADACCH_ACC13_MASK                        equ 0020h
ADACCH_ACC14_POSN                        equ 0006h
ADACCH_ACC14_POSITION                    equ 0006h
ADACCH_ACC14_SIZE                        equ 0001h
ADACCH_ACC14_LENGTH                      equ 0001h
ADACCH_ACC14_MASK                        equ 0040h
ADACCH_ACC15_POSN                        equ 0007h
ADACCH_ACC15_POSITION                    equ 0007h
ADACCH_ACC15_SIZE                        equ 0001h
ADACCH_ACC15_LENGTH                      equ 0001h
ADACCH_ACC15_MASK                        equ 0080h

// Register: ADCNT
#define ADCNT ADCNT
ADCNT                                    equ 03E6h
// bitfield definitions
ADCNT_CNT_POSN                           equ 0000h
ADCNT_CNT_POSITION                       equ 0000h
ADCNT_CNT_SIZE                           equ 0008h
ADCNT_CNT_LENGTH                         equ 0008h
ADCNT_CNT_MASK                           equ 00FFh
ADCNT_ADCNT0_POSN                        equ 0000h
ADCNT_ADCNT0_POSITION                    equ 0000h
ADCNT_ADCNT0_SIZE                        equ 0001h
ADCNT_ADCNT0_LENGTH                      equ 0001h
ADCNT_ADCNT0_MASK                        equ 0001h
ADCNT_ADCNT1_POSN                        equ 0001h
ADCNT_ADCNT1_POSITION                    equ 0001h
ADCNT_ADCNT1_SIZE                        equ 0001h
ADCNT_ADCNT1_LENGTH                      equ 0001h
ADCNT_ADCNT1_MASK                        equ 0002h
ADCNT_ADCNT2_POSN                        equ 0002h
ADCNT_ADCNT2_POSITION                    equ 0002h
ADCNT_ADCNT2_SIZE                        equ 0001h
ADCNT_ADCNT2_LENGTH                      equ 0001h
ADCNT_ADCNT2_MASK                        equ 0004h
ADCNT_ADCNT3_POSN                        equ 0003h
ADCNT_ADCNT3_POSITION                    equ 0003h
ADCNT_ADCNT3_SIZE                        equ 0001h
ADCNT_ADCNT3_LENGTH                      equ 0001h
ADCNT_ADCNT3_MASK                        equ 0008h
ADCNT_ADCNT4_POSN                        equ 0004h
ADCNT_ADCNT4_POSITION                    equ 0004h
ADCNT_ADCNT4_SIZE                        equ 0001h
ADCNT_ADCNT4_LENGTH                      equ 0001h
ADCNT_ADCNT4_MASK                        equ 0010h
ADCNT_ADCNT5_POSN                        equ 0005h
ADCNT_ADCNT5_POSITION                    equ 0005h
ADCNT_ADCNT5_SIZE                        equ 0001h
ADCNT_ADCNT5_LENGTH                      equ 0001h
ADCNT_ADCNT5_MASK                        equ 0020h
ADCNT_ADCNT6_POSN                        equ 0006h
ADCNT_ADCNT6_POSITION                    equ 0006h
ADCNT_ADCNT6_SIZE                        equ 0001h
ADCNT_ADCNT6_LENGTH                      equ 0001h
ADCNT_ADCNT6_MASK                        equ 0040h
ADCNT_ADCNT7_POSN                        equ 0007h
ADCNT_ADCNT7_POSITION                    equ 0007h
ADCNT_ADCNT7_SIZE                        equ 0001h
ADCNT_ADCNT7_LENGTH                      equ 0001h
ADCNT_ADCNT7_MASK                        equ 0080h
ADCNT_ADCNT_POSN                         equ 0000h
ADCNT_ADCNT_POSITION                     equ 0000h
ADCNT_ADCNT_SIZE                         equ 0008h
ADCNT_ADCNT_LENGTH                       equ 0008h
ADCNT_ADCNT_MASK                         equ 00FFh
ADCNT_CNT0_POSN                          equ 0000h
ADCNT_CNT0_POSITION                      equ 0000h
ADCNT_CNT0_SIZE                          equ 0001h
ADCNT_CNT0_LENGTH                        equ 0001h
ADCNT_CNT0_MASK                          equ 0001h
ADCNT_CNT1_POSN                          equ 0001h
ADCNT_CNT1_POSITION                      equ 0001h
ADCNT_CNT1_SIZE                          equ 0001h
ADCNT_CNT1_LENGTH                        equ 0001h
ADCNT_CNT1_MASK                          equ 0002h
ADCNT_CNT2_POSN                          equ 0002h
ADCNT_CNT2_POSITION                      equ 0002h
ADCNT_CNT2_SIZE                          equ 0001h
ADCNT_CNT2_LENGTH                        equ 0001h
ADCNT_CNT2_MASK                          equ 0004h
ADCNT_CNT3_POSN                          equ 0003h
ADCNT_CNT3_POSITION                      equ 0003h
ADCNT_CNT3_SIZE                          equ 0001h
ADCNT_CNT3_LENGTH                        equ 0001h
ADCNT_CNT3_MASK                          equ 0008h
ADCNT_CNT4_POSN                          equ 0004h
ADCNT_CNT4_POSITION                      equ 0004h
ADCNT_CNT4_SIZE                          equ 0001h
ADCNT_CNT4_LENGTH                        equ 0001h
ADCNT_CNT4_MASK                          equ 0010h
ADCNT_CNT5_POSN                          equ 0005h
ADCNT_CNT5_POSITION                      equ 0005h
ADCNT_CNT5_SIZE                          equ 0001h
ADCNT_CNT5_LENGTH                        equ 0001h
ADCNT_CNT5_MASK                          equ 0020h
ADCNT_CNT6_POSN                          equ 0006h
ADCNT_CNT6_POSITION                      equ 0006h
ADCNT_CNT6_SIZE                          equ 0001h
ADCNT_CNT6_LENGTH                        equ 0001h
ADCNT_CNT6_MASK                          equ 0040h
ADCNT_CNT7_POSN                          equ 0007h
ADCNT_CNT7_POSITION                      equ 0007h
ADCNT_CNT7_SIZE                          equ 0001h
ADCNT_CNT7_LENGTH                        equ 0001h
ADCNT_CNT7_MASK                          equ 0080h

// Register: ADRPT
#define ADRPT ADRPT
ADRPT                                    equ 03E7h
// bitfield definitions
ADRPT_RPT_POSN                           equ 0000h
ADRPT_RPT_POSITION                       equ 0000h
ADRPT_RPT_SIZE                           equ 0008h
ADRPT_RPT_LENGTH                         equ 0008h
ADRPT_RPT_MASK                           equ 00FFh
ADRPT_ADRPT0_POSN                        equ 0000h
ADRPT_ADRPT0_POSITION                    equ 0000h
ADRPT_ADRPT0_SIZE                        equ 0001h
ADRPT_ADRPT0_LENGTH                      equ 0001h
ADRPT_ADRPT0_MASK                        equ 0001h
ADRPT_ADRPT1_POSN                        equ 0001h
ADRPT_ADRPT1_POSITION                    equ 0001h
ADRPT_ADRPT1_SIZE                        equ 0001h
ADRPT_ADRPT1_LENGTH                      equ 0001h
ADRPT_ADRPT1_MASK                        equ 0002h
ADRPT_ADRPT2_POSN                        equ 0002h
ADRPT_ADRPT2_POSITION                    equ 0002h
ADRPT_ADRPT2_SIZE                        equ 0001h
ADRPT_ADRPT2_LENGTH                      equ 0001h
ADRPT_ADRPT2_MASK                        equ 0004h
ADRPT_ADRPT3_POSN                        equ 0003h
ADRPT_ADRPT3_POSITION                    equ 0003h
ADRPT_ADRPT3_SIZE                        equ 0001h
ADRPT_ADRPT3_LENGTH                      equ 0001h
ADRPT_ADRPT3_MASK                        equ 0008h
ADRPT_ADRPT4_POSN                        equ 0004h
ADRPT_ADRPT4_POSITION                    equ 0004h
ADRPT_ADRPT4_SIZE                        equ 0001h
ADRPT_ADRPT4_LENGTH                      equ 0001h
ADRPT_ADRPT4_MASK                        equ 0010h
ADRPT_ADRPT5_POSN                        equ 0005h
ADRPT_ADRPT5_POSITION                    equ 0005h
ADRPT_ADRPT5_SIZE                        equ 0001h
ADRPT_ADRPT5_LENGTH                      equ 0001h
ADRPT_ADRPT5_MASK                        equ 0020h
ADRPT_ADRPT6_POSN                        equ 0006h
ADRPT_ADRPT6_POSITION                    equ 0006h
ADRPT_ADRPT6_SIZE                        equ 0001h
ADRPT_ADRPT6_LENGTH                      equ 0001h
ADRPT_ADRPT6_MASK                        equ 0040h
ADRPT_ADRPT7_POSN                        equ 0007h
ADRPT_ADRPT7_POSITION                    equ 0007h
ADRPT_ADRPT7_SIZE                        equ 0001h
ADRPT_ADRPT7_LENGTH                      equ 0001h
ADRPT_ADRPT7_MASK                        equ 0080h
ADRPT_ADRPT_POSN                         equ 0000h
ADRPT_ADRPT_POSITION                     equ 0000h
ADRPT_ADRPT_SIZE                         equ 0008h
ADRPT_ADRPT_LENGTH                       equ 0008h
ADRPT_ADRPT_MASK                         equ 00FFh
ADRPT_RPT0_POSN                          equ 0000h
ADRPT_RPT0_POSITION                      equ 0000h
ADRPT_RPT0_SIZE                          equ 0001h
ADRPT_RPT0_LENGTH                        equ 0001h
ADRPT_RPT0_MASK                          equ 0001h
ADRPT_RPT1_POSN                          equ 0001h
ADRPT_RPT1_POSITION                      equ 0001h
ADRPT_RPT1_SIZE                          equ 0001h
ADRPT_RPT1_LENGTH                        equ 0001h
ADRPT_RPT1_MASK                          equ 0002h
ADRPT_RPT2_POSN                          equ 0002h
ADRPT_RPT2_POSITION                      equ 0002h
ADRPT_RPT2_SIZE                          equ 0001h
ADRPT_RPT2_LENGTH                        equ 0001h
ADRPT_RPT2_MASK                          equ 0004h
ADRPT_RPT3_POSN                          equ 0003h
ADRPT_RPT3_POSITION                      equ 0003h
ADRPT_RPT3_SIZE                          equ 0001h
ADRPT_RPT3_LENGTH                        equ 0001h
ADRPT_RPT3_MASK                          equ 0008h
ADRPT_RPT4_POSN                          equ 0004h
ADRPT_RPT4_POSITION                      equ 0004h
ADRPT_RPT4_SIZE                          equ 0001h
ADRPT_RPT4_LENGTH                        equ 0001h
ADRPT_RPT4_MASK                          equ 0010h
ADRPT_RPT5_POSN                          equ 0005h
ADRPT_RPT5_POSITION                      equ 0005h
ADRPT_RPT5_SIZE                          equ 0001h
ADRPT_RPT5_LENGTH                        equ 0001h
ADRPT_RPT5_MASK                          equ 0020h
ADRPT_RPT6_POSN                          equ 0006h
ADRPT_RPT6_POSITION                      equ 0006h
ADRPT_RPT6_SIZE                          equ 0001h
ADRPT_RPT6_LENGTH                        equ 0001h
ADRPT_RPT6_MASK                          equ 0040h
ADRPT_RPT7_POSN                          equ 0007h
ADRPT_RPT7_POSITION                      equ 0007h
ADRPT_RPT7_SIZE                          equ 0001h
ADRPT_RPT7_LENGTH                        equ 0001h
ADRPT_RPT7_MASK                          equ 0080h

// Register: ADPREV
#define ADPREV ADPREV
ADPREV                                   equ 03E8h

// Register: ADPREVL
#define ADPREVL ADPREVL
ADPREVL                                  equ 03E8h
// bitfield definitions
ADPREVL_PREV_POSN                        equ 0000h
ADPREVL_PREV_POSITION                    equ 0000h
ADPREVL_PREV_SIZE                        equ 0008h
ADPREVL_PREV_LENGTH                      equ 0008h
ADPREVL_PREV_MASK                        equ 00FFh
ADPREVL_ADPREV0_POSN                     equ 0000h
ADPREVL_ADPREV0_POSITION                 equ 0000h
ADPREVL_ADPREV0_SIZE                     equ 0001h
ADPREVL_ADPREV0_LENGTH                   equ 0001h
ADPREVL_ADPREV0_MASK                     equ 0001h
ADPREVL_ADPREV1_POSN                     equ 0001h
ADPREVL_ADPREV1_POSITION                 equ 0001h
ADPREVL_ADPREV1_SIZE                     equ 0001h
ADPREVL_ADPREV1_LENGTH                   equ 0001h
ADPREVL_ADPREV1_MASK                     equ 0002h
ADPREVL_ADPREV2_POSN                     equ 0002h
ADPREVL_ADPREV2_POSITION                 equ 0002h
ADPREVL_ADPREV2_SIZE                     equ 0001h
ADPREVL_ADPREV2_LENGTH                   equ 0001h
ADPREVL_ADPREV2_MASK                     equ 0004h
ADPREVL_ADPREV3_POSN                     equ 0003h
ADPREVL_ADPREV3_POSITION                 equ 0003h
ADPREVL_ADPREV3_SIZE                     equ 0001h
ADPREVL_ADPREV3_LENGTH                   equ 0001h
ADPREVL_ADPREV3_MASK                     equ 0008h
ADPREVL_ADPREV4_POSN                     equ 0004h
ADPREVL_ADPREV4_POSITION                 equ 0004h
ADPREVL_ADPREV4_SIZE                     equ 0001h
ADPREVL_ADPREV4_LENGTH                   equ 0001h
ADPREVL_ADPREV4_MASK                     equ 0010h
ADPREVL_ADPREV5_POSN                     equ 0005h
ADPREVL_ADPREV5_POSITION                 equ 0005h
ADPREVL_ADPREV5_SIZE                     equ 0001h
ADPREVL_ADPREV5_LENGTH                   equ 0001h
ADPREVL_ADPREV5_MASK                     equ 0020h
ADPREVL_ADPREV6_POSN                     equ 0006h
ADPREVL_ADPREV6_POSITION                 equ 0006h
ADPREVL_ADPREV6_SIZE                     equ 0001h
ADPREVL_ADPREV6_LENGTH                   equ 0001h
ADPREVL_ADPREV6_MASK                     equ 0040h
ADPREVL_ADPREV7_POSN                     equ 0007h
ADPREVL_ADPREV7_POSITION                 equ 0007h
ADPREVL_ADPREV7_SIZE                     equ 0001h
ADPREVL_ADPREV7_LENGTH                   equ 0001h
ADPREVL_ADPREV7_MASK                     equ 0080h
ADPREVL_ADPREV_POSN                      equ 0000h
ADPREVL_ADPREV_POSITION                  equ 0000h
ADPREVL_ADPREV_SIZE                      equ 0008h
ADPREVL_ADPREV_LENGTH                    equ 0008h
ADPREVL_ADPREV_MASK                      equ 00FFh
ADPREVL_PREV0_POSN                       equ 0000h
ADPREVL_PREV0_POSITION                   equ 0000h
ADPREVL_PREV0_SIZE                       equ 0001h
ADPREVL_PREV0_LENGTH                     equ 0001h
ADPREVL_PREV0_MASK                       equ 0001h
ADPREVL_PREV1_POSN                       equ 0001h
ADPREVL_PREV1_POSITION                   equ 0001h
ADPREVL_PREV1_SIZE                       equ 0001h
ADPREVL_PREV1_LENGTH                     equ 0001h
ADPREVL_PREV1_MASK                       equ 0002h
ADPREVL_PREV2_POSN                       equ 0002h
ADPREVL_PREV2_POSITION                   equ 0002h
ADPREVL_PREV2_SIZE                       equ 0001h
ADPREVL_PREV2_LENGTH                     equ 0001h
ADPREVL_PREV2_MASK                       equ 0004h
ADPREVL_PREV3_POSN                       equ 0003h
ADPREVL_PREV3_POSITION                   equ 0003h
ADPREVL_PREV3_SIZE                       equ 0001h
ADPREVL_PREV3_LENGTH                     equ 0001h
ADPREVL_PREV3_MASK                       equ 0008h
ADPREVL_PREV4_POSN                       equ 0004h
ADPREVL_PREV4_POSITION                   equ 0004h
ADPREVL_PREV4_SIZE                       equ 0001h
ADPREVL_PREV4_LENGTH                     equ 0001h
ADPREVL_PREV4_MASK                       equ 0010h
ADPREVL_PREV5_POSN                       equ 0005h
ADPREVL_PREV5_POSITION                   equ 0005h
ADPREVL_PREV5_SIZE                       equ 0001h
ADPREVL_PREV5_LENGTH                     equ 0001h
ADPREVL_PREV5_MASK                       equ 0020h
ADPREVL_PREV6_POSN                       equ 0006h
ADPREVL_PREV6_POSITION                   equ 0006h
ADPREVL_PREV6_SIZE                       equ 0001h
ADPREVL_PREV6_LENGTH                     equ 0001h
ADPREVL_PREV6_MASK                       equ 0040h
ADPREVL_PREV7_POSN                       equ 0007h
ADPREVL_PREV7_POSITION                   equ 0007h
ADPREVL_PREV7_SIZE                       equ 0001h
ADPREVL_PREV7_LENGTH                     equ 0001h
ADPREVL_PREV7_MASK                       equ 0080h

