garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.inc
#define DAC1PSS0                         BANKMASK(DAC1CON), 2, b
#define DAC1PSS1                         BANKMASK(DAC1CON), 3, b
#define DAC1R0                           BANKMASK(DAC1DATL), 0, b
#define DAC1R1                           BANKMASK(DAC1DATL), 1, b
#define DAC1R2                           BANKMASK(DAC1DATL), 2, b
#define DAC1R3                           BANKMASK(DAC1DATL), 3, b
#define DAC1R4                           BANKMASK(DAC1DATL), 4, b
#define DAC1R5                           BANKMASK(DAC1DATL), 5, b
#define DAC1R6                           BANKMASK(DAC1DATL), 6, b
#define DAC1R7                           BANKMASK(DAC1DATL), 7, b
#define DATA0                            BANKMASK(CRCDATAL), 0, b
#define DATA1                            BANKMASK(CRCDATAL), 1, b
#define DATA10                           BANKMASK(CRCDATAH), 2, b
#define DATA11                           BANKMASK(CRCDATAH), 3, b
#define DATA12                           BANKMASK(CRCDATAH), 4, b
#define DATA13                           BANKMASK(CRCDATAH), 5, b
#define DATA14                           BANKMASK(CRCDATAH), 6, b
#define DATA15                           BANKMASK(CRCDATAH), 7, b
#define DATA16                           BANKMASK(CRCDATAU), 0, b
#define DATA17                           BANKMASK(CRCDATAU), 1, b
#define DATA18                           BANKMASK(CRCDATAU), 2, b
#define DATA19                           BANKMASK(CRCDATAU), 3, b
#define DATA2                            BANKMASK(CRCDATAL), 2, b
#define DATA20                           BANKMASK(CRCDATAU), 4, b
#define DATA21                           BANKMASK(CRCDATAU), 5, b
#define DATA22                           BANKMASK(CRCDATAU), 6, b
#define DATA23                           BANKMASK(CRCDATAU), 7, b
#define DATA24                           BANKMASK(CRCDATAT), 0, b
#define DATA25                           BANKMASK(CRCDATAT), 1, b
#define DATA26                           BANKMASK(CRCDATAT), 2, b
#define DATA27                           BANKMASK(CRCDATAT), 3, b
#define DATA28                           BANKMASK(CRCDATAT), 4, b
#define DATA29                           BANKMASK(CRCDATAT), 5, b
#define DATA3                            BANKMASK(CRCDATAL), 3, b
#define DATA30                           BANKMASK(CRCDATAT), 6, b
#define DATA31                           BANKMASK(CRCDATAT), 7, b
#define DATA4                            BANKMASK(CRCDATAL), 4, b
#define DATA5                            BANKMASK(CRCDATAL), 5, b
#define DATA6                            BANKMASK(CRCDATAL), 6, b
#define DATA7                            BANKMASK(CRCDATAL), 7, b
#define DATA8                            BANKMASK(CRCDATAH), 0, b
#define DATA9                            BANKMASK(CRCDATAH), 1, b
#define DBF0                             BANKMASK(CWG1DBF), 0, b
#define DBF1                             BANKMASK(CWG1DBF), 1, b
#define DBF2                             BANKMASK(CWG1DBF), 2, b
#define DBF3                             BANKMASK(CWG1DBF), 3, b
#define DBF4                             BANKMASK(CWG1DBF), 4, b
#define DBF5                             BANKMASK(CWG1DBF), 5, b
#define DBR0                             BANKMASK(CWG1DBR), 0, b
#define DBR1                             BANKMASK(CWG1DBR), 1, b
#define DBR2                             BANKMASK(CWG1DBR), 2, b
#define DBR3                             BANKMASK(CWG1DBR), 3, b
#define DBR4                             BANKMASK(CWG1DBR), 4, b
#define DBR5                             BANKMASK(CWG1DBR), 5, b
#define DC0                              BANKMASK(CLKRCON), 3, b
#define DC1                              BANKMASK(CLKRCON), 4, b
#define DCNT0                            BANKMASK(DMAnDCNTL), 0, b
#define DCNT1                            BANKMASK(DMAnDCNTL), 1, b
#define DCNT10                           BANKMASK(DMAnDCNTH), 2, b
#define DCNT11                           BANKMASK(DMAnDCNTH), 3, b
#define DCNT2                            BANKMASK(DMAnDCNTL), 2, b
#define DCNT3                            BANKMASK(DMAnDCNTL), 3, b
#define DCNT4                            BANKMASK(DMAnDCNTL), 4, b
#define DCNT5                            BANKMASK(DMAnDCNTL), 5, b
#define DCNT6                            BANKMASK(DMAnDCNTL), 6, b
#define DCNT7                            BANKMASK(DMAnDCNTL), 7, b
#define DCNT8                            BANKMASK(DMAnDCNTH), 0, b
#define DCNT9                            BANKMASK(DMAnDCNTH), 1, b
#define DF0                              BANKMASK(PORTWDF), 0, b
#define DF1                              BANKMASK(PORTWDF), 1, b
#define DF2                              BANKMASK(PORTWDF), 2, b
#define DF3                              BANKMASK(PORTWDF), 3, b
#define DF4                              BANKMASK(PORTWDF), 4, b
#define DF5                              BANKMASK(PORTWDF), 5, b
#define DF6                              BANKMASK(PORTWDF), 6, b
#define DF7                              BANKMASK(PORTWDF), 7, b
#define DGO                              BANKMASK(DMAnCON0), 5, b
#define DIV0                             BANKMASK(CLKRCON), 0, b
#define DIV1                             BANKMASK(CLKRCON), 1, b
#define DIV2                             BANKMASK(CLKRCON), 2, b
#define DLEN0                            BANKMASK(CRCCON2), 0, b
#define DLEN1                            BANKMASK(CRCCON2), 1, b
#define DLEN2                            BANKMASK(CRCCON2), 2, b
#define DLEN3                            BANKMASK(CRCCON2), 3, b
#define DLEN4                            BANKMASK(CRCCON2), 4, b
#define DMA1AIE                          BANKMASK(PIE2), 7, a
#define DMA1AIF                          BANKMASK(PIR2), 7, a
#define DMA1AIP                          BANKMASK(IPR2), 7, a
#define DMA1DCNTIE                       BANKMASK(PIE2), 5, a
#define DMA1DCNTIF                       BANKMASK(PIR2), 5, a
#define DMA1DCNTIP                       BANKMASK(IPR2), 5, a
#define DMA1MD                           BANKMASK(PMD4), 5, b
#define DMA1ORIE                         BANKMASK(PIE2), 6, a
#define DMA1ORIF                         BANKMASK(PIR2), 6, a
#define DMA1ORIP                         BANKMASK(IPR2), 6, a
#define DMA1PR0                          BANKMASK(DMA1PR), 0, b
#define DMA1PR1                          BANKMASK(DMA1PR), 1, b
#define DMA1PR2                          BANKMASK(DMA1PR), 2, b
#define DMA1SCNTIE                       BANKMASK(PIE2), 4, a
#define DMA1SCNTIF                       BANKMASK(PIR2), 4, a
#define DMA1SCNTIP                       BANKMASK(IPR2), 4, a
#define DMA2AIE                          BANKMASK(PIE6), 7, a
#define DMA2AIF                          BANKMASK(PIR6), 7, a
#define DMA2AIP                          BANKMASK(IPR6), 7, a
#define DMA2DCNTIE                       BANKMASK(PIE6), 5, a
#define DMA2DCNTIF                       BANKMASK(PIR6), 5, a
#define DMA2DCNTIP                       BANKMASK(IPR6), 5, a
#define DMA2MD                           BANKMASK(PMD4), 6, b
#define DMA2ORIE                         BANKMASK(PIE6), 6, a
#define DMA2ORIF                         BANKMASK(PIR6), 6, a
#define DMA2ORIP                         BANKMASK(IPR6), 6, a
#define DMA2PR0                          BANKMASK(DMA2PR), 0, b
#define DMA2PR1                          BANKMASK(DMA2PR), 1, b
#define DMA2PR2                          BANKMASK(DMA2PR), 2, b
#define DMA2SCNTIE                       BANKMASK(PIE6), 4, a
#define DMA2SCNTIF                       BANKMASK(PIR6), 4, a
#define DMA2SCNTIP                       BANKMASK(IPR6), 4, a
#define DMA3AIE                          BANKMASK(PIE9), 7, a
#define DMA3AIF                          BANKMASK(PIR9), 7, a
#define DMA3AIP                          BANKMASK(IPR9), 7, a
#define DMA3DCNTIE                       BANKMASK(PIE9), 5, a
#define DMA3DCNTIF                       BANKMASK(PIR9), 5, a
#define DMA3DCNTIP                       BANKMASK(IPR9), 5, a
#define DMA3MD                           BANKMASK(PMD4), 7, b
#define DMA3ORIE                         BANKMASK(PIE9), 6, a
#define DMA3ORIF                         BANKMASK(PIR9), 6, a
#define DMA3ORIP                         BANKMASK(IPR9), 6, a
#define DMA3PR0                          BANKMASK(DMA3PR), 0, b
#define DMA3PR1                          BANKMASK(DMA3PR), 1, b
#define DMA3PR2                          BANKMASK(DMA3PR), 2, b
#define DMA3SCNTIE                       BANKMASK(PIE9), 4, a
#define DMA3SCNTIF                       BANKMASK(PIR9), 4, a
#define DMA3SCNTIP                       BANKMASK(IPR9), 4, a
#define DMA4AIE                          BANKMASK(PIE10), 7, a
#define DMA4AIF                          BANKMASK(PIR10), 7, a
#define DMA4AIP                          BANKMASK(IPR10), 7, a
#define DMA4DCNTIE                       BANKMASK(PIE10), 5, a
#define DMA4DCNTIF                       BANKMASK(PIR10), 5, a
#define DMA4DCNTIP                       BANKMASK(IPR10), 5, a
#define DMA4MD                           BANKMASK(PMD5), 3, b
#define DMA4ORIE                         BANKMASK(PIE10), 6, a
#define DMA4ORIF                         BANKMASK(PIR10), 6, a
#define DMA4ORIP                         BANKMASK(IPR10), 6, a
#define DMA4PR0                          BANKMASK(DMA4PR), 0, b
#define DMA4PR1                          BANKMASK(DMA4PR), 1, b
#define DMA4PR2                          BANKMASK(DMA4PR), 2, b
#define DMA4SCNTIE                       BANKMASK(PIE10), 4, a
#define DMA4SCNTIF                       BANKMASK(PIR10), 4, a
#define DMA4SCNTIP                       BANKMASK(IPR10), 4, a
#define DOE                              BANKMASK(CPUDOZE), 4, a
#define DONE                             BANKMASK(ADCON0), 0, b
#define DOZE0                            BANKMASK(CPUDOZE), 0, a
#define DOZE1                            BANKMASK(CPUDOZE), 1, a
#define DOZE2                            BANKMASK(CPUDOZE), 2, a
#define DOZEN                            BANKMASK(CPUDOZE), 6, a
#define DPTR0                            BANKMASK(DMAnDPTRL), 0, b
#define DPTR1                            BANKMASK(DMAnDPTRL), 1, b
#define DPTR10                           BANKMASK(DMAnDPTRH), 2, b
#define DPTR11                           BANKMASK(DMAnDPTRH), 3, b
#define DPTR12                           BANKMASK(DMAnDPTRH), 4, b
#define DPTR13                           BANKMASK(DMAnDPTRH), 5, b
#define DPTR14                           BANKMASK(DMAnDPTRH), 6, b
#define DPTR15                           BANKMASK(DMAnDPTRH), 7, b
#define DPTR2                            BANKMASK(DMAnDPTRL), 2, b
#define DPTR3                            BANKMASK(DMAnDPTRL), 3, b
#define DPTR4                            BANKMASK(DMAnDPTRL), 4, b
#define DPTR5                            BANKMASK(DMAnDPTRL), 5, b
#define DPTR6                            BANKMASK(DMAnDPTRL), 6, b
#define DPTR7                            BANKMASK(DMAnDPTRL), 7, b
#define DPTR8                            BANKMASK(DMAnDPTRH), 0, b
#define DPTR9                            BANKMASK(DMAnDPTRH), 1, b
#define DSA0                             BANKMASK(DMAnDSAL), 0, b
#define DSA1                             BANKMASK(DMAnDSAL), 1, b
#define DSA10                            BANKMASK(DMAnDSAH), 2, b
#define DSA11                            BANKMASK(DMAnDSAH), 3, b
#define DSA12                            BANKMASK(DMAnDSAH), 4, b
#define DSA13                            BANKMASK(DMAnDSAH), 5, b
#define DSA14                            BANKMASK(DMAnDSAH), 6, b
#define DSA15                            BANKMASK(DMAnDSAH), 7, b
#define DSA2                             BANKMASK(DMAnDSAL), 2, b
#define DSA3                             BANKMASK(DMAnDSAL), 3, b
#define DSA4                             BANKMASK(DMAnDSAL), 4, b
#define DSA5                             BANKMASK(DMAnDSAL), 5, b
#define DSA6                             BANKMASK(DMAnDSAL), 6, b
#define DSA7                             BANKMASK(DMAnDSAL), 7, b
#define DSA8                             BANKMASK(DMAnDSAH), 0, b
#define DSA9                             BANKMASK(DMAnDSAH), 1, b
#define DSEN                             BANKMASK(ADCON1), 0, b
#define DSTP                             BANKMASK(DMAnCON1), 5, b
#define DSZ0                             BANKMASK(DMAnDSZL), 0, b
#define DSZ1                             BANKMASK(DMAnDSZL), 1, b
#define DSZ10                            BANKMASK(DMAnDSZH), 2, b
#define DSZ11                            BANKMASK(DMAnDSZH), 3, b
#define DSZ2                             BANKMASK(DMAnDSZL), 2, b
#define DSZ3                             BANKMASK(DMAnDSZL), 3, b
#define DSZ4                             BANKMASK(DMAnDSZL), 4, b
#define DSZ5                             BANKMASK(DMAnDSZL), 5, b
#define DSZ6                             BANKMASK(DMAnDSZL), 6, b
#define DSZ7                             BANKMASK(DMAnDSZL), 7, b
#define DSZ8                             BANKMASK(DMAnDSZH), 0, b
#define DSZ9                             BANKMASK(DMAnDSZH), 1, b
#define ERR0                             BANKMASK(ADERRL), 0, b
#define ERR1                             BANKMASK(ADERRL), 1, b
#define ERR10                            BANKMASK(ADERRH), 2, b
#define ERR11                            BANKMASK(ADERRH), 3, b
#define ERR12                            BANKMASK(ADERRH), 4, b
#define ERR13                            BANKMASK(ADERRH), 5, b
#define ERR14                            BANKMASK(ADERRH), 6, b
#define ERR15                            BANKMASK(ADERRH), 7, b
#define ERR2                             BANKMASK(ADERRL), 2, b
#define ERR3                             BANKMASK(ADERRL), 3, b
#define ERR4                             BANKMASK(ADERRL), 4, b
#define ERR5                             BANKMASK(ADERRL), 5, b
#define ERR6                             BANKMASK(ADERRL), 6, b
#define ERR7                             BANKMASK(ADERRL), 7, b
#define ERR8                             BANKMASK(ADERRH), 0, b
#define ERR9                             BANKMASK(ADERRH), 1, b
#define EXTOEN                           BANKMASK(OSCEN), 7, b
#define EXTOR                            BANKMASK(OSCSTAT), 7, b
#define FLTR0                            BANKMASK(ADFLTRL), 0, b
#define FLTR1                            BANKMASK(ADFLTRL), 1, b
#define FLTR10                           BANKMASK(ADFLTRH), 2, b
#define FLTR11                           BANKMASK(ADFLTRH), 3, b
#define FLTR12                           BANKMASK(ADFLTRH), 4, b
#define FLTR13                           BANKMASK(ADFLTRH), 5, b
#define FLTR14                           BANKMASK(ADFLTRH), 6, b
#define FLTR15                           BANKMASK(ADFLTRH), 7, b
#define FLTR2                            BANKMASK(ADFLTRL), 2, b
#define FLTR3                            BANKMASK(ADFLTRL), 3, b
#define FLTR4                            BANKMASK(ADFLTRL), 4, b
#define FLTR5                            BANKMASK(ADFLTRL), 5, b
#define FLTR6                            BANKMASK(ADFLTRL), 6, b
#define FLTR7                            BANKMASK(ADFLTRL), 7, b
#define FLTR8                            BANKMASK(ADFLTRH), 0, b
#define FLTR9                            BANKMASK(ADFLTRH), 1, b
#define FM0                              BANKMASK(ADCON0), 2, b
#define FRQ0                             BANKMASK(OSCFRQ), 0, b
#define FRQ1                             BANKMASK(OSCFRQ), 1, b
#define FRQ2                             BANKMASK(OSCFRQ), 2, b
#define FRQ3                             BANKMASK(OSCFRQ), 3, b
#define FSCMFEV                          BANKMASK(FSCMCON), 0, b
#define FSCMFFI                          BANKMASK(FSCMCON), 1, b
#define FSCMPEV                          BANKMASK(FSCMCON), 2, b
#define FSCMPFI                          BANKMASK(FSCMCON), 3, b
#define FSCMSEV                          BANKMASK(FSCMCON), 4, b
#define FSCMSFI                          BANKMASK(FSCMCON), 5, b
#define FULL                             BANKMASK(CRCCON0), 0, b
#define FVREN                            BANKMASK(FVRCON), 7, b
#define FVRMD                            BANKMASK(PMD0), 6, b
#define FVRRDY                           BANKMASK(FVRCON), 6, b
#define G1D1N                            BANKMASK(CLCnGLS0), 0, b
#define G1D1T                            BANKMASK(CLCnGLS0), 1, b
#define G1D2N                            BANKMASK(CLCnGLS0), 2, b
#define G1D2T                            BANKMASK(CLCnGLS0), 3, b
#define G1D3N                            BANKMASK(CLCnGLS0), 4, b
#define G1D3T                            BANKMASK(CLCnGLS0), 5, b
#define G1D4N                            BANKMASK(CLCnGLS0), 6, b
#define G1D4T                            BANKMASK(CLCnGLS0), 7, b
#define G1EN                             BANKMASK(CWG1CON0), 7, b
#define G1POL                            BANKMASK(CLCnPOL), 0, b
#define G2D1N                            BANKMASK(CLCnGLS1), 0, b
#define G2D1T                            BANKMASK(CLCnGLS1), 1, b
#define G2D2N                            BANKMASK(CLCnGLS1), 2, b
#define G2D2T                            BANKMASK(CLCnGLS1), 3, b
#define G2D3N                            BANKMASK(CLCnGLS1), 4, b
#define G2D3T                            BANKMASK(CLCnGLS1), 5, b
#define G2D4N                            BANKMASK(CLCnGLS1), 6, b
#define G2D4T                            BANKMASK(CLCnGLS1), 7, b
#define G2POL                            BANKMASK(CLCnPOL), 1, b
#define G3D1N                            BANKMASK(CLCnGLS2), 0, b
#define G3D1T                            BANKMASK(CLCnGLS2), 1, b
#define G3D2N                            BANKMASK(CLCnGLS2), 2, b
#define G3D2T                            BANKMASK(CLCnGLS2), 3, b
#define G3D3N                            BANKMASK(CLCnGLS2), 4, b
#define G3D3T                            BANKMASK(CLCnGLS2), 5, b
#define G3D4N                            BANKMASK(CLCnGLS2), 6, b
#define G3D4T                            BANKMASK(CLCnGLS2), 7, b
#define G3POL                            BANKMASK(CLCnPOL), 2, b
#define G4D1N                            BANKMASK(CLCnGLS3), 0, b
#define G4D1T                            BANKMASK(CLCnGLS3), 1, b
#define G4D2N                            BANKMASK(CLCnGLS3), 2, b
#define G4D2T                            BANKMASK(CLCnGLS3), 3, b
#define G4D3N                            BANKMASK(CLCnGLS3), 4, b
#define G4D3T                            BANKMASK(CLCnGLS3), 5, b
#define G4D4N                            BANKMASK(CLCnGLS3), 6, b
#define G4D4T                            BANKMASK(CLCnGLS3), 7, b
#define G4POL                            BANKMASK(CLCnPOL), 3, b
#define GIE                              BANKMASK(INTCON0), 7, a
#define GIEH                             BANKMASK(INTCON0), 7, a
#define GIEL                             BANKMASK(INTCON0), 6, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 0, b
#define GO_nDONE                         BANKMASK(ADCON0), 0, b
#define HADR0                            BANKMASK(SCANHADRL), 0, b
#define HADR1                            BANKMASK(SCANHADRL), 1, b
#define HADR10                           BANKMASK(SCANHADRH), 2, b
#define HADR11                           BANKMASK(SCANHADRH), 3, b
#define HADR12                           BANKMASK(SCANHADRH), 4, b
#define HADR13                           BANKMASK(SCANHADRH), 5, b
#define HADR14                           BANKMASK(SCANHADRH), 6, b
#define HADR15                           BANKMASK(SCANHADRH), 7, b
#define HADR16                           BANKMASK(SCANHADRU), 0, b
#define HADR17                           BANKMASK(SCANHADRU), 1, b
#define HADR18                           BANKMASK(SCANHADRU), 2, b
#define HADR19                           BANKMASK(SCANHADRU), 3, b
#define HADR2                            BANKMASK(SCANHADRL), 2, b
#define HADR20                           BANKMASK(SCANHADRU), 4, b
#define HADR21                           BANKMASK(SCANHADRU), 5, b
#define HADR3                            BANKMASK(SCANHADRL), 3, b
#define HADR4                            BANKMASK(SCANHADRL), 4, b
#define HADR5                            BANKMASK(SCANHADRL), 5, b
#define HADR6                            BANKMASK(SCANHADRL), 6, b
#define HADR7                            BANKMASK(SCANHADRL), 7, b
#define HADR8                            BANKMASK(SCANHADRH), 0, b
#define HADR9                            BANKMASK(SCANHADRH), 1, b
#define HFOEN                            BANKMASK(OSCEN), 6, b
#define HFOR                             BANKMASK(OSCSTAT), 6, b
#define HLVDEN                           BANKMASK(HLVDCON0), 7, b
#define HLVDIE                           BANKMASK(PIE0), 1, a
#define HLVDIF                           BANKMASK(PIR0), 1, a
#define HLVDINTH                         BANKMASK(HLVDCON0), 1, b
#define HLVDINTL                         BANKMASK(HLVDCON0), 0, b
#define HLVDIP                           BANKMASK(IPR0), 1, a
#define HLVDMD                           BANKMASK(PMD0), 5, b
#define HLVDOUT                          BANKMASK(HLVDCON0), 5, b
#define HLVDRDY                          BANKMASK(HLVDCON0), 4, b
#define HLVDSEL0                         BANKMASK(HLVDCON1), 0, b
#define HLVDSEL1                         BANKMASK(HLVDCON1), 1, b
#define HLVDSEL2                         BANKMASK(HLVDCON1), 2, b
#define HLVDSEL3                         BANKMASK(HLVDCON1), 3, b
#define I2C1CNT0                         BANKMASK(I2C1CNTL), 0, b
#define I2C1CNT1                         BANKMASK(I2C1CNTL), 1, b
#define I2C1CNT10                        BANKMASK(I2C1CNTH), 2, b
#define I2C1CNT11                        BANKMASK(I2C1CNTH), 3, b
#define I2C1CNT12                        BANKMASK(I2C1CNTH), 4, b
#define I2C1CNT13                        BANKMASK(I2C1CNTH), 5, b
#define I2C1CNT14                        BANKMASK(I2C1CNTH), 6, b
#define I2C1CNT15                        BANKMASK(I2C1CNTH), 7, b
#define I2C1CNT2                         BANKMASK(I2C1CNTL), 2, b
#define I2C1CNT3                         BANKMASK(I2C1CNTL), 3, b
#define I2C1CNT4                         BANKMASK(I2C1CNTL), 4, b
#define I2C1CNT5                         BANKMASK(I2C1CNTL), 5, b
#define I2C1CNT6                         BANKMASK(I2C1CNTL), 6, b
#define I2C1CNT7                         BANKMASK(I2C1CNTL), 7, b
#define I2C1CNT8                         BANKMASK(I2C1CNTH), 0, b
#define I2C1CNT9                         BANKMASK(I2C1CNTH), 1, b
#define I2C1EIE                          BANKMASK(PIE7), 3, a
#define I2C1EIF                          BANKMASK(PIR7), 3, a
#define I2C1EIP                          BANKMASK(IPR7), 3, a
#define I2C1IE                           BANKMASK(PIE7), 2, a
#define I2C1IF                           BANKMASK(PIR7), 2, a
#define I2C1IP                           BANKMASK(IPR7), 2, a
#define I2C1MD                           BANKMASK(PMD3), 3, b
#define I2C1RXIE                         BANKMASK(PIE7), 0, a
#define I2C1RXIF                         BANKMASK(PIR7), 0, a
#define I2C1RXIP                         BANKMASK(IPR7), 0, a
#define I2C1SCLPPS0                      BANKMASK(I2C1SCLPPS), 0, b
#define I2C1SCLPPS1                      BANKMASK(I2C1SCLPPS), 1, b
#define I2C1SCLPPS2                      BANKMASK(I2C1SCLPPS), 2, b
#define I2C1SCLPPS3                      BANKMASK(I2C1SCLPPS), 3, b
#define I2C1SCLPPS4                      BANKMASK(I2C1SCLPPS), 4, b
#define I2C1SCLPPS5                      BANKMASK(I2C1SCLPPS), 5, b
#define I2C1SDAPPS0                      BANKMASK(I2C1SDAPPS), 0, b
#define I2C1SDAPPS1                      BANKMASK(I2C1SDAPPS), 1, b
#define I2C1SDAPPS2                      BANKMASK(I2C1SDAPPS), 2, b
#define I2C1SDAPPS3                      BANKMASK(I2C1SDAPPS), 3, b
#define I2C1SDAPPS4                      BANKMASK(I2C1SDAPPS), 4, b
#define I2C1SDAPPS5                      BANKMASK(I2C1SDAPPS), 5, b
#define I2C1TXIE                         BANKMASK(PIE7), 1, a
